###################################################################

# Created by write_sdc on Mon Jan 2 14:59:47 2017

###################################################################
set sdc_version 1.8

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_fanout 50 [current_design]
set_max_fanout 50 [get_ports clk]
set_max_fanout 50 [get_ports rst_n]
set_max_fanout 50 [get_ports test_mode]
set_max_fanout 50 [get_ports {operation[2]}]
set_max_fanout 50 [get_ports {operation[1]}]
set_max_fanout 50 [get_ports {operation[0]}]
set_max_fanout 50 [get_ports error_exceed_ignore]
set_max_fanout 50 [get_ports {allowable_faulty[15]}]
set_max_fanout 50 [get_ports {allowable_faulty[14]}]
set_max_fanout 50 [get_ports {allowable_faulty[13]}]
set_max_fanout 50 [get_ports {allowable_faulty[12]}]
set_max_fanout 50 [get_ports {allowable_faulty[11]}]
set_max_fanout 50 [get_ports {allowable_faulty[10]}]
set_max_fanout 50 [get_ports {allowable_faulty[9]}]
set_max_fanout 50 [get_ports {allowable_faulty[8]}]
set_max_fanout 50 [get_ports {allowable_faulty[7]}]
set_max_fanout 50 [get_ports {allowable_faulty[6]}]
set_max_fanout 50 [get_ports {allowable_faulty[5]}]
set_max_fanout 50 [get_ports {allowable_faulty[4]}]
set_max_fanout 50 [get_ports {allowable_faulty[3]}]
set_max_fanout 50 [get_ports {allowable_faulty[2]}]
set_max_fanout 50 [get_ports {allowable_faulty[1]}]
set_max_fanout 50 [get_ports {allowable_faulty[0]}]
set_max_fanout 50 [get_ports {memory_sel[2]}]
set_max_fanout 50 [get_ports {memory_sel[1]}]
set_max_fanout 50 [get_ports {memory_sel[0]}]
set_max_fanout 50 [get_ports {memtype[4]}]
set_max_fanout 50 [get_ports {memtype[3]}]
set_max_fanout 50 [get_ports {memtype[2]}]
set_max_fanout 50 [get_ports {memtype[1]}]
set_max_fanout 50 [get_ports {memtype[0]}]
set_max_fanout 50 [get_ports {rdata_7[63]}]
set_max_fanout 50 [get_ports {rdata_7[62]}]
set_max_fanout 50 [get_ports {rdata_7[61]}]
set_max_fanout 50 [get_ports {rdata_7[60]}]
set_max_fanout 50 [get_ports {rdata_7[59]}]
set_max_fanout 50 [get_ports {rdata_7[58]}]
set_max_fanout 50 [get_ports {rdata_7[57]}]
set_max_fanout 50 [get_ports {rdata_7[56]}]
set_max_fanout 50 [get_ports {rdata_7[55]}]
set_max_fanout 50 [get_ports {rdata_7[54]}]
set_max_fanout 50 [get_ports {rdata_7[53]}]
set_max_fanout 50 [get_ports {rdata_7[52]}]
set_max_fanout 50 [get_ports {rdata_7[51]}]
set_max_fanout 50 [get_ports {rdata_7[50]}]
set_max_fanout 50 [get_ports {rdata_7[49]}]
set_max_fanout 50 [get_ports {rdata_7[48]}]
set_max_fanout 50 [get_ports {rdata_7[47]}]
set_max_fanout 50 [get_ports {rdata_7[46]}]
set_max_fanout 50 [get_ports {rdata_7[45]}]
set_max_fanout 50 [get_ports {rdata_7[44]}]
set_max_fanout 50 [get_ports {rdata_7[43]}]
set_max_fanout 50 [get_ports {rdata_7[42]}]
set_max_fanout 50 [get_ports {rdata_7[41]}]
set_max_fanout 50 [get_ports {rdata_7[40]}]
set_max_fanout 50 [get_ports {rdata_7[39]}]
set_max_fanout 50 [get_ports {rdata_7[38]}]
set_max_fanout 50 [get_ports {rdata_7[37]}]
set_max_fanout 50 [get_ports {rdata_7[36]}]
set_max_fanout 50 [get_ports {rdata_7[35]}]
set_max_fanout 50 [get_ports {rdata_7[34]}]
set_max_fanout 50 [get_ports {rdata_7[33]}]
set_max_fanout 50 [get_ports {rdata_7[32]}]
set_max_fanout 50 [get_ports {rdata_7[31]}]
set_max_fanout 50 [get_ports {rdata_7[30]}]
set_max_fanout 50 [get_ports {rdata_7[29]}]
set_max_fanout 50 [get_ports {rdata_7[28]}]
set_max_fanout 50 [get_ports {rdata_7[27]}]
set_max_fanout 50 [get_ports {rdata_7[26]}]
set_max_fanout 50 [get_ports {rdata_7[25]}]
set_max_fanout 50 [get_ports {rdata_7[24]}]
set_max_fanout 50 [get_ports {rdata_7[23]}]
set_max_fanout 50 [get_ports {rdata_7[22]}]
set_max_fanout 50 [get_ports {rdata_7[21]}]
set_max_fanout 50 [get_ports {rdata_7[20]}]
set_max_fanout 50 [get_ports {rdata_7[19]}]
set_max_fanout 50 [get_ports {rdata_7[18]}]
set_max_fanout 50 [get_ports {rdata_7[17]}]
set_max_fanout 50 [get_ports {rdata_7[16]}]
set_max_fanout 50 [get_ports {rdata_7[15]}]
set_max_fanout 50 [get_ports {rdata_7[14]}]
set_max_fanout 50 [get_ports {rdata_7[13]}]
set_max_fanout 50 [get_ports {rdata_7[12]}]
set_max_fanout 50 [get_ports {rdata_7[11]}]
set_max_fanout 50 [get_ports {rdata_7[10]}]
set_max_fanout 50 [get_ports {rdata_7[9]}]
set_max_fanout 50 [get_ports {rdata_7[8]}]
set_max_fanout 50 [get_ports {rdata_7[7]}]
set_max_fanout 50 [get_ports {rdata_7[6]}]
set_max_fanout 50 [get_ports {rdata_7[5]}]
set_max_fanout 50 [get_ports {rdata_7[4]}]
set_max_fanout 50 [get_ports {rdata_7[3]}]
set_max_fanout 50 [get_ports {rdata_7[2]}]
set_max_fanout 50 [get_ports {rdata_7[1]}]
set_max_fanout 50 [get_ports {rdata_7[0]}]
set_max_fanout 50 [get_ports {rdata_6[63]}]
set_max_fanout 50 [get_ports {rdata_6[62]}]
set_max_fanout 50 [get_ports {rdata_6[61]}]
set_max_fanout 50 [get_ports {rdata_6[60]}]
set_max_fanout 50 [get_ports {rdata_6[59]}]
set_max_fanout 50 [get_ports {rdata_6[58]}]
set_max_fanout 50 [get_ports {rdata_6[57]}]
set_max_fanout 50 [get_ports {rdata_6[56]}]
set_max_fanout 50 [get_ports {rdata_6[55]}]
set_max_fanout 50 [get_ports {rdata_6[54]}]
set_max_fanout 50 [get_ports {rdata_6[53]}]
set_max_fanout 50 [get_ports {rdata_6[52]}]
set_max_fanout 50 [get_ports {rdata_6[51]}]
set_max_fanout 50 [get_ports {rdata_6[50]}]
set_max_fanout 50 [get_ports {rdata_6[49]}]
set_max_fanout 50 [get_ports {rdata_6[48]}]
set_max_fanout 50 [get_ports {rdata_6[47]}]
set_max_fanout 50 [get_ports {rdata_6[46]}]
set_max_fanout 50 [get_ports {rdata_6[45]}]
set_max_fanout 50 [get_ports {rdata_6[44]}]
set_max_fanout 50 [get_ports {rdata_6[43]}]
set_max_fanout 50 [get_ports {rdata_6[42]}]
set_max_fanout 50 [get_ports {rdata_6[41]}]
set_max_fanout 50 [get_ports {rdata_6[40]}]
set_max_fanout 50 [get_ports {rdata_6[39]}]
set_max_fanout 50 [get_ports {rdata_6[38]}]
set_max_fanout 50 [get_ports {rdata_6[37]}]
set_max_fanout 50 [get_ports {rdata_6[36]}]
set_max_fanout 50 [get_ports {rdata_6[35]}]
set_max_fanout 50 [get_ports {rdata_6[34]}]
set_max_fanout 50 [get_ports {rdata_6[33]}]
set_max_fanout 50 [get_ports {rdata_6[32]}]
set_max_fanout 50 [get_ports {rdata_6[31]}]
set_max_fanout 50 [get_ports {rdata_6[30]}]
set_max_fanout 50 [get_ports {rdata_6[29]}]
set_max_fanout 50 [get_ports {rdata_6[28]}]
set_max_fanout 50 [get_ports {rdata_6[27]}]
set_max_fanout 50 [get_ports {rdata_6[26]}]
set_max_fanout 50 [get_ports {rdata_6[25]}]
set_max_fanout 50 [get_ports {rdata_6[24]}]
set_max_fanout 50 [get_ports {rdata_6[23]}]
set_max_fanout 50 [get_ports {rdata_6[22]}]
set_max_fanout 50 [get_ports {rdata_6[21]}]
set_max_fanout 50 [get_ports {rdata_6[20]}]
set_max_fanout 50 [get_ports {rdata_6[19]}]
set_max_fanout 50 [get_ports {rdata_6[18]}]
set_max_fanout 50 [get_ports {rdata_6[17]}]
set_max_fanout 50 [get_ports {rdata_6[16]}]
set_max_fanout 50 [get_ports {rdata_6[15]}]
set_max_fanout 50 [get_ports {rdata_6[14]}]
set_max_fanout 50 [get_ports {rdata_6[13]}]
set_max_fanout 50 [get_ports {rdata_6[12]}]
set_max_fanout 50 [get_ports {rdata_6[11]}]
set_max_fanout 50 [get_ports {rdata_6[10]}]
set_max_fanout 50 [get_ports {rdata_6[9]}]
set_max_fanout 50 [get_ports {rdata_6[8]}]
set_max_fanout 50 [get_ports {rdata_6[7]}]
set_max_fanout 50 [get_ports {rdata_6[6]}]
set_max_fanout 50 [get_ports {rdata_6[5]}]
set_max_fanout 50 [get_ports {rdata_6[4]}]
set_max_fanout 50 [get_ports {rdata_6[3]}]
set_max_fanout 50 [get_ports {rdata_6[2]}]
set_max_fanout 50 [get_ports {rdata_6[1]}]
set_max_fanout 50 [get_ports {rdata_6[0]}]
set_max_fanout 50 [get_ports {rdata_5[63]}]
set_max_fanout 50 [get_ports {rdata_5[62]}]
set_max_fanout 50 [get_ports {rdata_5[61]}]
set_max_fanout 50 [get_ports {rdata_5[60]}]
set_max_fanout 50 [get_ports {rdata_5[59]}]
set_max_fanout 50 [get_ports {rdata_5[58]}]
set_max_fanout 50 [get_ports {rdata_5[57]}]
set_max_fanout 50 [get_ports {rdata_5[56]}]
set_max_fanout 50 [get_ports {rdata_5[55]}]
set_max_fanout 50 [get_ports {rdata_5[54]}]
set_max_fanout 50 [get_ports {rdata_5[53]}]
set_max_fanout 50 [get_ports {rdata_5[52]}]
set_max_fanout 50 [get_ports {rdata_5[51]}]
set_max_fanout 50 [get_ports {rdata_5[50]}]
set_max_fanout 50 [get_ports {rdata_5[49]}]
set_max_fanout 50 [get_ports {rdata_5[48]}]
set_max_fanout 50 [get_ports {rdata_5[47]}]
set_max_fanout 50 [get_ports {rdata_5[46]}]
set_max_fanout 50 [get_ports {rdata_5[45]}]
set_max_fanout 50 [get_ports {rdata_5[44]}]
set_max_fanout 50 [get_ports {rdata_5[43]}]
set_max_fanout 50 [get_ports {rdata_5[42]}]
set_max_fanout 50 [get_ports {rdata_5[41]}]
set_max_fanout 50 [get_ports {rdata_5[40]}]
set_max_fanout 50 [get_ports {rdata_5[39]}]
set_max_fanout 50 [get_ports {rdata_5[38]}]
set_max_fanout 50 [get_ports {rdata_5[37]}]
set_max_fanout 50 [get_ports {rdata_5[36]}]
set_max_fanout 50 [get_ports {rdata_5[35]}]
set_max_fanout 50 [get_ports {rdata_5[34]}]
set_max_fanout 50 [get_ports {rdata_5[33]}]
set_max_fanout 50 [get_ports {rdata_5[32]}]
set_max_fanout 50 [get_ports {rdata_5[31]}]
set_max_fanout 50 [get_ports {rdata_5[30]}]
set_max_fanout 50 [get_ports {rdata_5[29]}]
set_max_fanout 50 [get_ports {rdata_5[28]}]
set_max_fanout 50 [get_ports {rdata_5[27]}]
set_max_fanout 50 [get_ports {rdata_5[26]}]
set_max_fanout 50 [get_ports {rdata_5[25]}]
set_max_fanout 50 [get_ports {rdata_5[24]}]
set_max_fanout 50 [get_ports {rdata_5[23]}]
set_max_fanout 50 [get_ports {rdata_5[22]}]
set_max_fanout 50 [get_ports {rdata_5[21]}]
set_max_fanout 50 [get_ports {rdata_5[20]}]
set_max_fanout 50 [get_ports {rdata_5[19]}]
set_max_fanout 50 [get_ports {rdata_5[18]}]
set_max_fanout 50 [get_ports {rdata_5[17]}]
set_max_fanout 50 [get_ports {rdata_5[16]}]
set_max_fanout 50 [get_ports {rdata_5[15]}]
set_max_fanout 50 [get_ports {rdata_5[14]}]
set_max_fanout 50 [get_ports {rdata_5[13]}]
set_max_fanout 50 [get_ports {rdata_5[12]}]
set_max_fanout 50 [get_ports {rdata_5[11]}]
set_max_fanout 50 [get_ports {rdata_5[10]}]
set_max_fanout 50 [get_ports {rdata_5[9]}]
set_max_fanout 50 [get_ports {rdata_5[8]}]
set_max_fanout 50 [get_ports {rdata_5[7]}]
set_max_fanout 50 [get_ports {rdata_5[6]}]
set_max_fanout 50 [get_ports {rdata_5[5]}]
set_max_fanout 50 [get_ports {rdata_5[4]}]
set_max_fanout 50 [get_ports {rdata_5[3]}]
set_max_fanout 50 [get_ports {rdata_5[2]}]
set_max_fanout 50 [get_ports {rdata_5[1]}]
set_max_fanout 50 [get_ports {rdata_5[0]}]
set_max_fanout 50 [get_ports {rdata_4[63]}]
set_max_fanout 50 [get_ports {rdata_4[62]}]
set_max_fanout 50 [get_ports {rdata_4[61]}]
set_max_fanout 50 [get_ports {rdata_4[60]}]
set_max_fanout 50 [get_ports {rdata_4[59]}]
set_max_fanout 50 [get_ports {rdata_4[58]}]
set_max_fanout 50 [get_ports {rdata_4[57]}]
set_max_fanout 50 [get_ports {rdata_4[56]}]
set_max_fanout 50 [get_ports {rdata_4[55]}]
set_max_fanout 50 [get_ports {rdata_4[54]}]
set_max_fanout 50 [get_ports {rdata_4[53]}]
set_max_fanout 50 [get_ports {rdata_4[52]}]
set_max_fanout 50 [get_ports {rdata_4[51]}]
set_max_fanout 50 [get_ports {rdata_4[50]}]
set_max_fanout 50 [get_ports {rdata_4[49]}]
set_max_fanout 50 [get_ports {rdata_4[48]}]
set_max_fanout 50 [get_ports {rdata_4[47]}]
set_max_fanout 50 [get_ports {rdata_4[46]}]
set_max_fanout 50 [get_ports {rdata_4[45]}]
set_max_fanout 50 [get_ports {rdata_4[44]}]
set_max_fanout 50 [get_ports {rdata_4[43]}]
set_max_fanout 50 [get_ports {rdata_4[42]}]
set_max_fanout 50 [get_ports {rdata_4[41]}]
set_max_fanout 50 [get_ports {rdata_4[40]}]
set_max_fanout 50 [get_ports {rdata_4[39]}]
set_max_fanout 50 [get_ports {rdata_4[38]}]
set_max_fanout 50 [get_ports {rdata_4[37]}]
set_max_fanout 50 [get_ports {rdata_4[36]}]
set_max_fanout 50 [get_ports {rdata_4[35]}]
set_max_fanout 50 [get_ports {rdata_4[34]}]
set_max_fanout 50 [get_ports {rdata_4[33]}]
set_max_fanout 50 [get_ports {rdata_4[32]}]
set_max_fanout 50 [get_ports {rdata_4[31]}]
set_max_fanout 50 [get_ports {rdata_4[30]}]
set_max_fanout 50 [get_ports {rdata_4[29]}]
set_max_fanout 50 [get_ports {rdata_4[28]}]
set_max_fanout 50 [get_ports {rdata_4[27]}]
set_max_fanout 50 [get_ports {rdata_4[26]}]
set_max_fanout 50 [get_ports {rdata_4[25]}]
set_max_fanout 50 [get_ports {rdata_4[24]}]
set_max_fanout 50 [get_ports {rdata_4[23]}]
set_max_fanout 50 [get_ports {rdata_4[22]}]
set_max_fanout 50 [get_ports {rdata_4[21]}]
set_max_fanout 50 [get_ports {rdata_4[20]}]
set_max_fanout 50 [get_ports {rdata_4[19]}]
set_max_fanout 50 [get_ports {rdata_4[18]}]
set_max_fanout 50 [get_ports {rdata_4[17]}]
set_max_fanout 50 [get_ports {rdata_4[16]}]
set_max_fanout 50 [get_ports {rdata_4[15]}]
set_max_fanout 50 [get_ports {rdata_4[14]}]
set_max_fanout 50 [get_ports {rdata_4[13]}]
set_max_fanout 50 [get_ports {rdata_4[12]}]
set_max_fanout 50 [get_ports {rdata_4[11]}]
set_max_fanout 50 [get_ports {rdata_4[10]}]
set_max_fanout 50 [get_ports {rdata_4[9]}]
set_max_fanout 50 [get_ports {rdata_4[8]}]
set_max_fanout 50 [get_ports {rdata_4[7]}]
set_max_fanout 50 [get_ports {rdata_4[6]}]
set_max_fanout 50 [get_ports {rdata_4[5]}]
set_max_fanout 50 [get_ports {rdata_4[4]}]
set_max_fanout 50 [get_ports {rdata_4[3]}]
set_max_fanout 50 [get_ports {rdata_4[2]}]
set_max_fanout 50 [get_ports {rdata_4[1]}]
set_max_fanout 50 [get_ports {rdata_4[0]}]
set_max_fanout 50 [get_ports {rdata_3[63]}]
set_max_fanout 50 [get_ports {rdata_3[62]}]
set_max_fanout 50 [get_ports {rdata_3[61]}]
set_max_fanout 50 [get_ports {rdata_3[60]}]
set_max_fanout 50 [get_ports {rdata_3[59]}]
set_max_fanout 50 [get_ports {rdata_3[58]}]
set_max_fanout 50 [get_ports {rdata_3[57]}]
set_max_fanout 50 [get_ports {rdata_3[56]}]
set_max_fanout 50 [get_ports {rdata_3[55]}]
set_max_fanout 50 [get_ports {rdata_3[54]}]
set_max_fanout 50 [get_ports {rdata_3[53]}]
set_max_fanout 50 [get_ports {rdata_3[52]}]
set_max_fanout 50 [get_ports {rdata_3[51]}]
set_max_fanout 50 [get_ports {rdata_3[50]}]
set_max_fanout 50 [get_ports {rdata_3[49]}]
set_max_fanout 50 [get_ports {rdata_3[48]}]
set_max_fanout 50 [get_ports {rdata_3[47]}]
set_max_fanout 50 [get_ports {rdata_3[46]}]
set_max_fanout 50 [get_ports {rdata_3[45]}]
set_max_fanout 50 [get_ports {rdata_3[44]}]
set_max_fanout 50 [get_ports {rdata_3[43]}]
set_max_fanout 50 [get_ports {rdata_3[42]}]
set_max_fanout 50 [get_ports {rdata_3[41]}]
set_max_fanout 50 [get_ports {rdata_3[40]}]
set_max_fanout 50 [get_ports {rdata_3[39]}]
set_max_fanout 50 [get_ports {rdata_3[38]}]
set_max_fanout 50 [get_ports {rdata_3[37]}]
set_max_fanout 50 [get_ports {rdata_3[36]}]
set_max_fanout 50 [get_ports {rdata_3[35]}]
set_max_fanout 50 [get_ports {rdata_3[34]}]
set_max_fanout 50 [get_ports {rdata_3[33]}]
set_max_fanout 50 [get_ports {rdata_3[32]}]
set_max_fanout 50 [get_ports {rdata_3[31]}]
set_max_fanout 50 [get_ports {rdata_3[30]}]
set_max_fanout 50 [get_ports {rdata_3[29]}]
set_max_fanout 50 [get_ports {rdata_3[28]}]
set_max_fanout 50 [get_ports {rdata_3[27]}]
set_max_fanout 50 [get_ports {rdata_3[26]}]
set_max_fanout 50 [get_ports {rdata_3[25]}]
set_max_fanout 50 [get_ports {rdata_3[24]}]
set_max_fanout 50 [get_ports {rdata_3[23]}]
set_max_fanout 50 [get_ports {rdata_3[22]}]
set_max_fanout 50 [get_ports {rdata_3[21]}]
set_max_fanout 50 [get_ports {rdata_3[20]}]
set_max_fanout 50 [get_ports {rdata_3[19]}]
set_max_fanout 50 [get_ports {rdata_3[18]}]
set_max_fanout 50 [get_ports {rdata_3[17]}]
set_max_fanout 50 [get_ports {rdata_3[16]}]
set_max_fanout 50 [get_ports {rdata_3[15]}]
set_max_fanout 50 [get_ports {rdata_3[14]}]
set_max_fanout 50 [get_ports {rdata_3[13]}]
set_max_fanout 50 [get_ports {rdata_3[12]}]
set_max_fanout 50 [get_ports {rdata_3[11]}]
set_max_fanout 50 [get_ports {rdata_3[10]}]
set_max_fanout 50 [get_ports {rdata_3[9]}]
set_max_fanout 50 [get_ports {rdata_3[8]}]
set_max_fanout 50 [get_ports {rdata_3[7]}]
set_max_fanout 50 [get_ports {rdata_3[6]}]
set_max_fanout 50 [get_ports {rdata_3[5]}]
set_max_fanout 50 [get_ports {rdata_3[4]}]
set_max_fanout 50 [get_ports {rdata_3[3]}]
set_max_fanout 50 [get_ports {rdata_3[2]}]
set_max_fanout 50 [get_ports {rdata_3[1]}]
set_max_fanout 50 [get_ports {rdata_3[0]}]
set_max_fanout 50 [get_ports {rdata_2[63]}]
set_max_fanout 50 [get_ports {rdata_2[62]}]
set_max_fanout 50 [get_ports {rdata_2[61]}]
set_max_fanout 50 [get_ports {rdata_2[60]}]
set_max_fanout 50 [get_ports {rdata_2[59]}]
set_max_fanout 50 [get_ports {rdata_2[58]}]
set_max_fanout 50 [get_ports {rdata_2[57]}]
set_max_fanout 50 [get_ports {rdata_2[56]}]
set_max_fanout 50 [get_ports {rdata_2[55]}]
set_max_fanout 50 [get_ports {rdata_2[54]}]
set_max_fanout 50 [get_ports {rdata_2[53]}]
set_max_fanout 50 [get_ports {rdata_2[52]}]
set_max_fanout 50 [get_ports {rdata_2[51]}]
set_max_fanout 50 [get_ports {rdata_2[50]}]
set_max_fanout 50 [get_ports {rdata_2[49]}]
set_max_fanout 50 [get_ports {rdata_2[48]}]
set_max_fanout 50 [get_ports {rdata_2[47]}]
set_max_fanout 50 [get_ports {rdata_2[46]}]
set_max_fanout 50 [get_ports {rdata_2[45]}]
set_max_fanout 50 [get_ports {rdata_2[44]}]
set_max_fanout 50 [get_ports {rdata_2[43]}]
set_max_fanout 50 [get_ports {rdata_2[42]}]
set_max_fanout 50 [get_ports {rdata_2[41]}]
set_max_fanout 50 [get_ports {rdata_2[40]}]
set_max_fanout 50 [get_ports {rdata_2[39]}]
set_max_fanout 50 [get_ports {rdata_2[38]}]
set_max_fanout 50 [get_ports {rdata_2[37]}]
set_max_fanout 50 [get_ports {rdata_2[36]}]
set_max_fanout 50 [get_ports {rdata_2[35]}]
set_max_fanout 50 [get_ports {rdata_2[34]}]
set_max_fanout 50 [get_ports {rdata_2[33]}]
set_max_fanout 50 [get_ports {rdata_2[32]}]
set_max_fanout 50 [get_ports {rdata_2[31]}]
set_max_fanout 50 [get_ports {rdata_2[30]}]
set_max_fanout 50 [get_ports {rdata_2[29]}]
set_max_fanout 50 [get_ports {rdata_2[28]}]
set_max_fanout 50 [get_ports {rdata_2[27]}]
set_max_fanout 50 [get_ports {rdata_2[26]}]
set_max_fanout 50 [get_ports {rdata_2[25]}]
set_max_fanout 50 [get_ports {rdata_2[24]}]
set_max_fanout 50 [get_ports {rdata_2[23]}]
set_max_fanout 50 [get_ports {rdata_2[22]}]
set_max_fanout 50 [get_ports {rdata_2[21]}]
set_max_fanout 50 [get_ports {rdata_2[20]}]
set_max_fanout 50 [get_ports {rdata_2[19]}]
set_max_fanout 50 [get_ports {rdata_2[18]}]
set_max_fanout 50 [get_ports {rdata_2[17]}]
set_max_fanout 50 [get_ports {rdata_2[16]}]
set_max_fanout 50 [get_ports {rdata_2[15]}]
set_max_fanout 50 [get_ports {rdata_2[14]}]
set_max_fanout 50 [get_ports {rdata_2[13]}]
set_max_fanout 50 [get_ports {rdata_2[12]}]
set_max_fanout 50 [get_ports {rdata_2[11]}]
set_max_fanout 50 [get_ports {rdata_2[10]}]
set_max_fanout 50 [get_ports {rdata_2[9]}]
set_max_fanout 50 [get_ports {rdata_2[8]}]
set_max_fanout 50 [get_ports {rdata_2[7]}]
set_max_fanout 50 [get_ports {rdata_2[6]}]
set_max_fanout 50 [get_ports {rdata_2[5]}]
set_max_fanout 50 [get_ports {rdata_2[4]}]
set_max_fanout 50 [get_ports {rdata_2[3]}]
set_max_fanout 50 [get_ports {rdata_2[2]}]
set_max_fanout 50 [get_ports {rdata_2[1]}]
set_max_fanout 50 [get_ports {rdata_2[0]}]
set_max_fanout 50 [get_ports {rdata_1[63]}]
set_max_fanout 50 [get_ports {rdata_1[62]}]
set_max_fanout 50 [get_ports {rdata_1[61]}]
set_max_fanout 50 [get_ports {rdata_1[60]}]
set_max_fanout 50 [get_ports {rdata_1[59]}]
set_max_fanout 50 [get_ports {rdata_1[58]}]
set_max_fanout 50 [get_ports {rdata_1[57]}]
set_max_fanout 50 [get_ports {rdata_1[56]}]
set_max_fanout 50 [get_ports {rdata_1[55]}]
set_max_fanout 50 [get_ports {rdata_1[54]}]
set_max_fanout 50 [get_ports {rdata_1[53]}]
set_max_fanout 50 [get_ports {rdata_1[52]}]
set_max_fanout 50 [get_ports {rdata_1[51]}]
set_max_fanout 50 [get_ports {rdata_1[50]}]
set_max_fanout 50 [get_ports {rdata_1[49]}]
set_max_fanout 50 [get_ports {rdata_1[48]}]
set_max_fanout 50 [get_ports {rdata_1[47]}]
set_max_fanout 50 [get_ports {rdata_1[46]}]
set_max_fanout 50 [get_ports {rdata_1[45]}]
set_max_fanout 50 [get_ports {rdata_1[44]}]
set_max_fanout 50 [get_ports {rdata_1[43]}]
set_max_fanout 50 [get_ports {rdata_1[42]}]
set_max_fanout 50 [get_ports {rdata_1[41]}]
set_max_fanout 50 [get_ports {rdata_1[40]}]
set_max_fanout 50 [get_ports {rdata_1[39]}]
set_max_fanout 50 [get_ports {rdata_1[38]}]
set_max_fanout 50 [get_ports {rdata_1[37]}]
set_max_fanout 50 [get_ports {rdata_1[36]}]
set_max_fanout 50 [get_ports {rdata_1[35]}]
set_max_fanout 50 [get_ports {rdata_1[34]}]
set_max_fanout 50 [get_ports {rdata_1[33]}]
set_max_fanout 50 [get_ports {rdata_1[32]}]
set_max_fanout 50 [get_ports {rdata_1[31]}]
set_max_fanout 50 [get_ports {rdata_1[30]}]
set_max_fanout 50 [get_ports {rdata_1[29]}]
set_max_fanout 50 [get_ports {rdata_1[28]}]
set_max_fanout 50 [get_ports {rdata_1[27]}]
set_max_fanout 50 [get_ports {rdata_1[26]}]
set_max_fanout 50 [get_ports {rdata_1[25]}]
set_max_fanout 50 [get_ports {rdata_1[24]}]
set_max_fanout 50 [get_ports {rdata_1[23]}]
set_max_fanout 50 [get_ports {rdata_1[22]}]
set_max_fanout 50 [get_ports {rdata_1[21]}]
set_max_fanout 50 [get_ports {rdata_1[20]}]
set_max_fanout 50 [get_ports {rdata_1[19]}]
set_max_fanout 50 [get_ports {rdata_1[18]}]
set_max_fanout 50 [get_ports {rdata_1[17]}]
set_max_fanout 50 [get_ports {rdata_1[16]}]
set_max_fanout 50 [get_ports {rdata_1[15]}]
set_max_fanout 50 [get_ports {rdata_1[14]}]
set_max_fanout 50 [get_ports {rdata_1[13]}]
set_max_fanout 50 [get_ports {rdata_1[12]}]
set_max_fanout 50 [get_ports {rdata_1[11]}]
set_max_fanout 50 [get_ports {rdata_1[10]}]
set_max_fanout 50 [get_ports {rdata_1[9]}]
set_max_fanout 50 [get_ports {rdata_1[8]}]
set_max_fanout 50 [get_ports {rdata_1[7]}]
set_max_fanout 50 [get_ports {rdata_1[6]}]
set_max_fanout 50 [get_ports {rdata_1[5]}]
set_max_fanout 50 [get_ports {rdata_1[4]}]
set_max_fanout 50 [get_ports {rdata_1[3]}]
set_max_fanout 50 [get_ports {rdata_1[2]}]
set_max_fanout 50 [get_ports {rdata_1[1]}]
set_max_fanout 50 [get_ports {rdata_1[0]}]
set_max_fanout 50 [get_ports {rdata_0[63]}]
set_max_fanout 50 [get_ports {rdata_0[62]}]
set_max_fanout 50 [get_ports {rdata_0[61]}]
set_max_fanout 50 [get_ports {rdata_0[60]}]
set_max_fanout 50 [get_ports {rdata_0[59]}]
set_max_fanout 50 [get_ports {rdata_0[58]}]
set_max_fanout 50 [get_ports {rdata_0[57]}]
set_max_fanout 50 [get_ports {rdata_0[56]}]
set_max_fanout 50 [get_ports {rdata_0[55]}]
set_max_fanout 50 [get_ports {rdata_0[54]}]
set_max_fanout 50 [get_ports {rdata_0[53]}]
set_max_fanout 50 [get_ports {rdata_0[52]}]
set_max_fanout 50 [get_ports {rdata_0[51]}]
set_max_fanout 50 [get_ports {rdata_0[50]}]
set_max_fanout 50 [get_ports {rdata_0[49]}]
set_max_fanout 50 [get_ports {rdata_0[48]}]
set_max_fanout 50 [get_ports {rdata_0[47]}]
set_max_fanout 50 [get_ports {rdata_0[46]}]
set_max_fanout 50 [get_ports {rdata_0[45]}]
set_max_fanout 50 [get_ports {rdata_0[44]}]
set_max_fanout 50 [get_ports {rdata_0[43]}]
set_max_fanout 50 [get_ports {rdata_0[42]}]
set_max_fanout 50 [get_ports {rdata_0[41]}]
set_max_fanout 50 [get_ports {rdata_0[40]}]
set_max_fanout 50 [get_ports {rdata_0[39]}]
set_max_fanout 50 [get_ports {rdata_0[38]}]
set_max_fanout 50 [get_ports {rdata_0[37]}]
set_max_fanout 50 [get_ports {rdata_0[36]}]
set_max_fanout 50 [get_ports {rdata_0[35]}]
set_max_fanout 50 [get_ports {rdata_0[34]}]
set_max_fanout 50 [get_ports {rdata_0[33]}]
set_max_fanout 50 [get_ports {rdata_0[32]}]
set_max_fanout 50 [get_ports {rdata_0[31]}]
set_max_fanout 50 [get_ports {rdata_0[30]}]
set_max_fanout 50 [get_ports {rdata_0[29]}]
set_max_fanout 50 [get_ports {rdata_0[28]}]
set_max_fanout 50 [get_ports {rdata_0[27]}]
set_max_fanout 50 [get_ports {rdata_0[26]}]
set_max_fanout 50 [get_ports {rdata_0[25]}]
set_max_fanout 50 [get_ports {rdata_0[24]}]
set_max_fanout 50 [get_ports {rdata_0[23]}]
set_max_fanout 50 [get_ports {rdata_0[22]}]
set_max_fanout 50 [get_ports {rdata_0[21]}]
set_max_fanout 50 [get_ports {rdata_0[20]}]
set_max_fanout 50 [get_ports {rdata_0[19]}]
set_max_fanout 50 [get_ports {rdata_0[18]}]
set_max_fanout 50 [get_ports {rdata_0[17]}]
set_max_fanout 50 [get_ports {rdata_0[16]}]
set_max_fanout 50 [get_ports {rdata_0[15]}]
set_max_fanout 50 [get_ports {rdata_0[14]}]
set_max_fanout 50 [get_ports {rdata_0[13]}]
set_max_fanout 50 [get_ports {rdata_0[12]}]
set_max_fanout 50 [get_ports {rdata_0[11]}]
set_max_fanout 50 [get_ports {rdata_0[10]}]
set_max_fanout 50 [get_ports {rdata_0[9]}]
set_max_fanout 50 [get_ports {rdata_0[8]}]
set_max_fanout 50 [get_ports {rdata_0[7]}]
set_max_fanout 50 [get_ports {rdata_0[6]}]
set_max_fanout 50 [get_ports {rdata_0[5]}]
set_max_fanout 50 [get_ports {rdata_0[4]}]
set_max_fanout 50 [get_ports {rdata_0[3]}]
set_max_fanout 50 [get_ports {rdata_0[2]}]
set_max_fanout 50 [get_ports {rdata_0[1]}]
set_max_fanout 50 [get_ports {rdata_0[0]}]
set_ideal_network [get_ports rst_n]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.1  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -rise 0.1 [get_clocks clk]
set_clock_transition -fall 0.1 [get_clocks clk]
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports test_mode] [get_ports {operation[2]}] [get_ports {operation[1]}] [get_ports {operation[0]}] [get_ports error_exceed_ignore] [get_ports {allowable_faulty[15]}] [get_ports {allowable_faulty[14]}] [get_ports {allowable_faulty[13]}] [get_ports {allowable_faulty[12]}] [get_ports {allowable_faulty[11]}] [get_ports {allowable_faulty[10]}] [get_ports {allowable_faulty[9]}] [get_ports {allowable_faulty[8]}] [get_ports {allowable_faulty[7]}] [get_ports {allowable_faulty[6]}] [get_ports {allowable_faulty[5]}] [get_ports {allowable_faulty[4]}] [get_ports {allowable_faulty[3]}] [get_ports {allowable_faulty[2]}] [get_ports {allowable_faulty[1]}] [get_ports {allowable_faulty[0]}] [get_ports {memory_sel[2]}] [get_ports {memory_sel[1]}] [get_ports {memory_sel[0]}] [get_ports {memtype[4]}] [get_ports {memtype[3]}] [get_ports {memtype[2]}] [get_ports {memtype[1]}] [get_ports {memtype[0]}] [get_ports {rdata_7[63]}] [get_ports {rdata_7[62]}] [get_ports {rdata_7[61]}] [get_ports {rdata_7[60]}] [get_ports {rdata_7[59]}] [get_ports {rdata_7[58]}] [get_ports {rdata_7[57]}] [get_ports {rdata_7[56]}] [get_ports {rdata_7[55]}] [get_ports {rdata_7[54]}] [get_ports {rdata_7[53]}] [get_ports {rdata_7[52]}] [get_ports {rdata_7[51]}] [get_ports {rdata_7[50]}] [get_ports {rdata_7[49]}] [get_ports {rdata_7[48]}] [get_ports {rdata_7[47]}] [get_ports {rdata_7[46]}] [get_ports {rdata_7[45]}] [get_ports {rdata_7[44]}] [get_ports {rdata_7[43]}] [get_ports {rdata_7[42]}] [get_ports {rdata_7[41]}] [get_ports {rdata_7[40]}] [get_ports {rdata_7[39]}] [get_ports {rdata_7[38]}] [get_ports {rdata_7[37]}] [get_ports {rdata_7[36]}] [get_ports {rdata_7[35]}] [get_ports {rdata_7[34]}] [get_ports {rdata_7[33]}] [get_ports {rdata_7[32]}] [get_ports {rdata_7[31]}] [get_ports {rdata_7[30]}] [get_ports {rdata_7[29]}] [get_ports {rdata_7[28]}] [get_ports {rdata_7[27]}] [get_ports {rdata_7[26]}] [get_ports {rdata_7[25]}] [get_ports {rdata_7[24]}] [get_ports {rdata_7[23]}] [get_ports {rdata_7[22]}] [get_ports {rdata_7[21]}] [get_ports {rdata_7[20]}] [get_ports {rdata_7[19]}] [get_ports {rdata_7[18]}] [get_ports {rdata_7[17]}] [get_ports {rdata_7[16]}] [get_ports {rdata_7[15]}] [get_ports {rdata_7[14]}] [get_ports {rdata_7[13]}] [get_ports {rdata_7[12]}] [get_ports {rdata_7[11]}] [get_ports {rdata_7[10]}] [get_ports {rdata_7[9]}] [get_ports {rdata_7[8]}] [get_ports {rdata_7[7]}] [get_ports {rdata_7[6]}] [get_ports {rdata_7[5]}] [get_ports {rdata_7[4]}] [get_ports {rdata_7[3]}] [get_ports {rdata_7[2]}] [get_ports {rdata_7[1]}] [get_ports {rdata_7[0]}] [get_ports {rdata_6[63]}] [get_ports {rdata_6[62]}] [get_ports {rdata_6[61]}] [get_ports {rdata_6[60]}] [get_ports {rdata_6[59]}] [get_ports {rdata_6[58]}] [get_ports {rdata_6[57]}] [get_ports {rdata_6[56]}] [get_ports {rdata_6[55]}] [get_ports {rdata_6[54]}] [get_ports {rdata_6[53]}] [get_ports {rdata_6[52]}] [get_ports {rdata_6[51]}] [get_ports {rdata_6[50]}] [get_ports {rdata_6[49]}] [get_ports {rdata_6[48]}] [get_ports {rdata_6[47]}] [get_ports {rdata_6[46]}] [get_ports {rdata_6[45]}] [get_ports {rdata_6[44]}] [get_ports {rdata_6[43]}] [get_ports {rdata_6[42]}] [get_ports {rdata_6[41]}] [get_ports {rdata_6[40]}] [get_ports {rdata_6[39]}] [get_ports {rdata_6[38]}] [get_ports {rdata_6[37]}] [get_ports {rdata_6[36]}] [get_ports {rdata_6[35]}] [get_ports {rdata_6[34]}] [get_ports {rdata_6[33]}] [get_ports {rdata_6[32]}] [get_ports {rdata_6[31]}] [get_ports {rdata_6[30]}] [get_ports {rdata_6[29]}] [get_ports {rdata_6[28]}] [get_ports {rdata_6[27]}] [get_ports {rdata_6[26]}] [get_ports {rdata_6[25]}] [get_ports {rdata_6[24]}] [get_ports {rdata_6[23]}] [get_ports {rdata_6[22]}] [get_ports {rdata_6[21]}] [get_ports {rdata_6[20]}] [get_ports {rdata_6[19]}] [get_ports {rdata_6[18]}] [get_ports {rdata_6[17]}] [get_ports {rdata_6[16]}] [get_ports {rdata_6[15]}] [get_ports {rdata_6[14]}] [get_ports {rdata_6[13]}] [get_ports {rdata_6[12]}] [get_ports {rdata_6[11]}] [get_ports {rdata_6[10]}] [get_ports {rdata_6[9]}] [get_ports {rdata_6[8]}] [get_ports {rdata_6[7]}] [get_ports {rdata_6[6]}] [get_ports {rdata_6[5]}] [get_ports {rdata_6[4]}] [get_ports {rdata_6[3]}] [get_ports {rdata_6[2]}] [get_ports {rdata_6[1]}] [get_ports {rdata_6[0]}] [get_ports {rdata_5[63]}] [get_ports {rdata_5[62]}] [get_ports {rdata_5[61]}] [get_ports {rdata_5[60]}] [get_ports {rdata_5[59]}] [get_ports {rdata_5[58]}] [get_ports {rdata_5[57]}] [get_ports {rdata_5[56]}] [get_ports {rdata_5[55]}] [get_ports {rdata_5[54]}] [get_ports {rdata_5[53]}] [get_ports {rdata_5[52]}] [get_ports {rdata_5[51]}] [get_ports {rdata_5[50]}] [get_ports {rdata_5[49]}] [get_ports {rdata_5[48]}] [get_ports {rdata_5[47]}] [get_ports {rdata_5[46]}] [get_ports {rdata_5[45]}] [get_ports {rdata_5[44]}] [get_ports {rdata_5[43]}] [get_ports {rdata_5[42]}] [get_ports {rdata_5[41]}] [get_ports {rdata_5[40]}] [get_ports {rdata_5[39]}] [get_ports {rdata_5[38]}] [get_ports {rdata_5[37]}] [get_ports {rdata_5[36]}] [get_ports {rdata_5[35]}] [get_ports {rdata_5[34]}] [get_ports {rdata_5[33]}] [get_ports {rdata_5[32]}] [get_ports {rdata_5[31]}] [get_ports {rdata_5[30]}] [get_ports {rdata_5[29]}] [get_ports {rdata_5[28]}] [get_ports {rdata_5[27]}] [get_ports {rdata_5[26]}] [get_ports {rdata_5[25]}] [get_ports {rdata_5[24]}] [get_ports {rdata_5[23]}] [get_ports {rdata_5[22]}] [get_ports {rdata_5[21]}] [get_ports {rdata_5[20]}] [get_ports {rdata_5[19]}] [get_ports {rdata_5[18]}] [get_ports {rdata_5[17]}] [get_ports {rdata_5[16]}] [get_ports {rdata_5[15]}] [get_ports {rdata_5[14]}] [get_ports {rdata_5[13]}] [get_ports {rdata_5[12]}] [get_ports {rdata_5[11]}] [get_ports {rdata_5[10]}] [get_ports {rdata_5[9]}] [get_ports {rdata_5[8]}] [get_ports {rdata_5[7]}] [get_ports {rdata_5[6]}] [get_ports {rdata_5[5]}] [get_ports {rdata_5[4]}] [get_ports {rdata_5[3]}] [get_ports {rdata_5[2]}] [get_ports {rdata_5[1]}] [get_ports {rdata_5[0]}] [get_ports {rdata_4[63]}] [get_ports {rdata_4[62]}] [get_ports {rdata_4[61]}] [get_ports {rdata_4[60]}] [get_ports {rdata_4[59]}] [get_ports {rdata_4[58]}] [get_ports {rdata_4[57]}] [get_ports {rdata_4[56]}] [get_ports {rdata_4[55]}] [get_ports {rdata_4[54]}] [get_ports {rdata_4[53]}] [get_ports {rdata_4[52]}] [get_ports {rdata_4[51]}] [get_ports {rdata_4[50]}] [get_ports {rdata_4[49]}] [get_ports {rdata_4[48]}] [get_ports {rdata_4[47]}] [get_ports {rdata_4[46]}] [get_ports {rdata_4[45]}] [get_ports {rdata_4[44]}] [get_ports {rdata_4[43]}] [get_ports {rdata_4[42]}] [get_ports {rdata_4[41]}] [get_ports {rdata_4[40]}] [get_ports {rdata_4[39]}] [get_ports {rdata_4[38]}] [get_ports {rdata_4[37]}] [get_ports {rdata_4[36]}] [get_ports {rdata_4[35]}] [get_ports {rdata_4[34]}] [get_ports {rdata_4[33]}] [get_ports {rdata_4[32]}] [get_ports {rdata_4[31]}] [get_ports {rdata_4[30]}] [get_ports {rdata_4[29]}] [get_ports {rdata_4[28]}] [get_ports {rdata_4[27]}] [get_ports {rdata_4[26]}] [get_ports {rdata_4[25]}] [get_ports {rdata_4[24]}] [get_ports {rdata_4[23]}] [get_ports {rdata_4[22]}] [get_ports {rdata_4[21]}] [get_ports {rdata_4[20]}] [get_ports {rdata_4[19]}] [get_ports {rdata_4[18]}] [get_ports {rdata_4[17]}] [get_ports {rdata_4[16]}] [get_ports {rdata_4[15]}] [get_ports {rdata_4[14]}] [get_ports {rdata_4[13]}] [get_ports {rdata_4[12]}] [get_ports {rdata_4[11]}] [get_ports {rdata_4[10]}] [get_ports {rdata_4[9]}] [get_ports {rdata_4[8]}] [get_ports {rdata_4[7]}] [get_ports {rdata_4[6]}] [get_ports {rdata_4[5]}] [get_ports {rdata_4[4]}] [get_ports {rdata_4[3]}] [get_ports {rdata_4[2]}] [get_ports {rdata_4[1]}] [get_ports {rdata_4[0]}] [get_ports {rdata_3[63]}] [get_ports {rdata_3[62]}] [get_ports {rdata_3[61]}] [get_ports {rdata_3[60]}] [get_ports {rdata_3[59]}] [get_ports {rdata_3[58]}] [get_ports {rdata_3[57]}] [get_ports {rdata_3[56]}] [get_ports {rdata_3[55]}] [get_ports {rdata_3[54]}] [get_ports {rdata_3[53]}] [get_ports {rdata_3[52]}] [get_ports {rdata_3[51]}] [get_ports {rdata_3[50]}] [get_ports {rdata_3[49]}] [get_ports {rdata_3[48]}] [get_ports {rdata_3[47]}] [get_ports {rdata_3[46]}] [get_ports {rdata_3[45]}] [get_ports {rdata_3[44]}] [get_ports {rdata_3[43]}] [get_ports {rdata_3[42]}] [get_ports {rdata_3[41]}] [get_ports {rdata_3[40]}] [get_ports {rdata_3[39]}] [get_ports {rdata_3[38]}] [get_ports {rdata_3[37]}] [get_ports {rdata_3[36]}] [get_ports {rdata_3[35]}] [get_ports {rdata_3[34]}] [get_ports {rdata_3[33]}] [get_ports {rdata_3[32]}] [get_ports {rdata_3[31]}] [get_ports {rdata_3[30]}] [get_ports {rdata_3[29]}] [get_ports {rdata_3[28]}] [get_ports {rdata_3[27]}] [get_ports {rdata_3[26]}] [get_ports {rdata_3[25]}] [get_ports {rdata_3[24]}] [get_ports {rdata_3[23]}] [get_ports {rdata_3[22]}] [get_ports {rdata_3[21]}] [get_ports {rdata_3[20]}] [get_ports {rdata_3[19]}] [get_ports {rdata_3[18]}] [get_ports {rdata_3[17]}] [get_ports {rdata_3[16]}] [get_ports {rdata_3[15]}] [get_ports {rdata_3[14]}] [get_ports {rdata_3[13]}] [get_ports {rdata_3[12]}] [get_ports {rdata_3[11]}] [get_ports {rdata_3[10]}] [get_ports {rdata_3[9]}] [get_ports {rdata_3[8]}] [get_ports {rdata_3[7]}] [get_ports {rdata_3[6]}] [get_ports {rdata_3[5]}] [get_ports {rdata_3[4]}] [get_ports {rdata_3[3]}] [get_ports {rdata_3[2]}] [get_ports {rdata_3[1]}] [get_ports {rdata_3[0]}] [get_ports {rdata_2[63]}] [get_ports {rdata_2[62]}] [get_ports {rdata_2[61]}] [get_ports {rdata_2[60]}] [get_ports {rdata_2[59]}] [get_ports {rdata_2[58]}] [get_ports {rdata_2[57]}] [get_ports {rdata_2[56]}] [get_ports {rdata_2[55]}] [get_ports {rdata_2[54]}] [get_ports {rdata_2[53]}] [get_ports {rdata_2[52]}] [get_ports {rdata_2[51]}] [get_ports {rdata_2[50]}] [get_ports {rdata_2[49]}] [get_ports {rdata_2[48]}] [get_ports {rdata_2[47]}] [get_ports {rdata_2[46]}] [get_ports {rdata_2[45]}] [get_ports {rdata_2[44]}] [get_ports {rdata_2[43]}] [get_ports {rdata_2[42]}] [get_ports {rdata_2[41]}] [get_ports {rdata_2[40]}] [get_ports {rdata_2[39]}] [get_ports {rdata_2[38]}] [get_ports {rdata_2[37]}] [get_ports {rdata_2[36]}] [get_ports {rdata_2[35]}] [get_ports {rdata_2[34]}] [get_ports {rdata_2[33]}] [get_ports {rdata_2[32]}] [get_ports {rdata_2[31]}] [get_ports {rdata_2[30]}] [get_ports {rdata_2[29]}] [get_ports {rdata_2[28]}] [get_ports {rdata_2[27]}] [get_ports {rdata_2[26]}] [get_ports {rdata_2[25]}] [get_ports {rdata_2[24]}] [get_ports {rdata_2[23]}] [get_ports {rdata_2[22]}] [get_ports {rdata_2[21]}] [get_ports {rdata_2[20]}] [get_ports {rdata_2[19]}] [get_ports {rdata_2[18]}] [get_ports {rdata_2[17]}] [get_ports {rdata_2[16]}] [get_ports {rdata_2[15]}] [get_ports {rdata_2[14]}] [get_ports {rdata_2[13]}] [get_ports {rdata_2[12]}] [get_ports {rdata_2[11]}] [get_ports {rdata_2[10]}] [get_ports {rdata_2[9]}] [get_ports {rdata_2[8]}] [get_ports {rdata_2[7]}] [get_ports {rdata_2[6]}] [get_ports {rdata_2[5]}] [get_ports {rdata_2[4]}] [get_ports {rdata_2[3]}] [get_ports {rdata_2[2]}] [get_ports {rdata_2[1]}] [get_ports {rdata_2[0]}] [get_ports {rdata_1[63]}] [get_ports {rdata_1[62]}] [get_ports {rdata_1[61]}] [get_ports {rdata_1[60]}] [get_ports {rdata_1[59]}] [get_ports {rdata_1[58]}] [get_ports {rdata_1[57]}] [get_ports {rdata_1[56]}] [get_ports {rdata_1[55]}] [get_ports {rdata_1[54]}] [get_ports {rdata_1[53]}] [get_ports {rdata_1[52]}] [get_ports {rdata_1[51]}] [get_ports {rdata_1[50]}] [get_ports {rdata_1[49]}] [get_ports {rdata_1[48]}] [get_ports {rdata_1[47]}] [get_ports {rdata_1[46]}] [get_ports {rdata_1[45]}] [get_ports {rdata_1[44]}] [get_ports {rdata_1[43]}] [get_ports {rdata_1[42]}] [get_ports {rdata_1[41]}] [get_ports {rdata_1[40]}] [get_ports {rdata_1[39]}] [get_ports {rdata_1[38]}] [get_ports {rdata_1[37]}] [get_ports {rdata_1[36]}] [get_ports {rdata_1[35]}] [get_ports {rdata_1[34]}] [get_ports {rdata_1[33]}] [get_ports {rdata_1[32]}] [get_ports {rdata_1[31]}] [get_ports {rdata_1[30]}] [get_ports {rdata_1[29]}] [get_ports {rdata_1[28]}] [get_ports {rdata_1[27]}] [get_ports {rdata_1[26]}] [get_ports {rdata_1[25]}] [get_ports {rdata_1[24]}] [get_ports {rdata_1[23]}] [get_ports {rdata_1[22]}] [get_ports {rdata_1[21]}] [get_ports {rdata_1[20]}] [get_ports {rdata_1[19]}] [get_ports {rdata_1[18]}] [get_ports {rdata_1[17]}] [get_ports {rdata_1[16]}] [get_ports {rdata_1[15]}] [get_ports {rdata_1[14]}] [get_ports {rdata_1[13]}] [get_ports {rdata_1[12]}] [get_ports {rdata_1[11]}] [get_ports {rdata_1[10]}] [get_ports {rdata_1[9]}] [get_ports {rdata_1[8]}] [get_ports {rdata_1[7]}] [get_ports {rdata_1[6]}] [get_ports {rdata_1[5]}] [get_ports {rdata_1[4]}] [get_ports {rdata_1[3]}] [get_ports {rdata_1[2]}] [get_ports {rdata_1[1]}] [get_ports {rdata_1[0]}] [get_ports {rdata_0[63]}] [get_ports {rdata_0[62]}] [get_ports {rdata_0[61]}] [get_ports {rdata_0[60]}] [get_ports {rdata_0[59]}] [get_ports {rdata_0[58]}] [get_ports {rdata_0[57]}] [get_ports {rdata_0[56]}] [get_ports {rdata_0[55]}] [get_ports {rdata_0[54]}] [get_ports {rdata_0[53]}] [get_ports {rdata_0[52]}] [get_ports {rdata_0[51]}] [get_ports {rdata_0[50]}] [get_ports {rdata_0[49]}] [get_ports {rdata_0[48]}] [get_ports {rdata_0[47]}] [get_ports {rdata_0[46]}] [get_ports {rdata_0[45]}] [get_ports {rdata_0[44]}] [get_ports {rdata_0[43]}] [get_ports {rdata_0[42]}] [get_ports {rdata_0[41]}] [get_ports {rdata_0[40]}] [get_ports {rdata_0[39]}] [get_ports {rdata_0[38]}] [get_ports {rdata_0[37]}] [get_ports {rdata_0[36]}] [get_ports {rdata_0[35]}] [get_ports {rdata_0[34]}] [get_ports {rdata_0[33]}] [get_ports {rdata_0[32]}] [get_ports {rdata_0[31]}] [get_ports {rdata_0[30]}] [get_ports {rdata_0[29]}] [get_ports {rdata_0[28]}] [get_ports {rdata_0[27]}] [get_ports {rdata_0[26]}] [get_ports {rdata_0[25]}] [get_ports {rdata_0[24]}] [get_ports {rdata_0[23]}] [get_ports {rdata_0[22]}] [get_ports {rdata_0[21]}] [get_ports {rdata_0[20]}] [get_ports {rdata_0[19]}] [get_ports {rdata_0[18]}] [get_ports {rdata_0[17]}] [get_ports {rdata_0[16]}] [get_ports {rdata_0[15]}] [get_ports {rdata_0[14]}] [get_ports {rdata_0[13]}] [get_ports {rdata_0[12]}] [get_ports {rdata_0[11]}] [get_ports {rdata_0[10]}] [get_ports {rdata_0[9]}] [get_ports {rdata_0[8]}] [get_ports {rdata_0[7]}] [get_ports {rdata_0[6]}] [get_ports {rdata_0[5]}] [get_ports {rdata_0[4]}] [get_ports {rdata_0[3]}] [get_ports {rdata_0[2]}] [get_ports {rdata_0[1]}] [get_ports {rdata_0[0]}]]  -to [list [get_ports {address_7[15]}] [get_ports {address_7[14]}] [get_ports {address_7[13]}] [get_ports {address_7[12]}] [get_ports {address_7[11]}] [get_ports {address_7[10]}] [get_ports {address_7[9]}] [get_ports {address_7[8]}] [get_ports {address_7[7]}] [get_ports {address_7[6]}] [get_ports {address_7[5]}] [get_ports {address_7[4]}] [get_ports {address_7[3]}] [get_ports {address_7[2]}] [get_ports {address_7[1]}] [get_ports {address_7[0]}] [get_ports {address_6[15]}] [get_ports {address_6[14]}] [get_ports {address_6[13]}] [get_ports {address_6[12]}] [get_ports {address_6[11]}] [get_ports {address_6[10]}] [get_ports {address_6[9]}] [get_ports {address_6[8]}] [get_ports {address_6[7]}] [get_ports {address_6[6]}] [get_ports {address_6[5]}] [get_ports {address_6[4]}] [get_ports {address_6[3]}] [get_ports {address_6[2]}] [get_ports {address_6[1]}] [get_ports {address_6[0]}] [get_ports {address_5[15]}] [get_ports {address_5[14]}] [get_ports {address_5[13]}] [get_ports {address_5[12]}] [get_ports {address_5[11]}] [get_ports {address_5[10]}] [get_ports {address_5[9]}] [get_ports {address_5[8]}] [get_ports {address_5[7]}] [get_ports {address_5[6]}] [get_ports {address_5[5]}] [get_ports {address_5[4]}] [get_ports {address_5[3]}] [get_ports {address_5[2]}] [get_ports {address_5[1]}] [get_ports {address_5[0]}] [get_ports {address_4[15]}] [get_ports {address_4[14]}] [get_ports {address_4[13]}] [get_ports {address_4[12]}] [get_ports {address_4[11]}] [get_ports {address_4[10]}] [get_ports {address_4[9]}] [get_ports {address_4[8]}] [get_ports {address_4[7]}] [get_ports {address_4[6]}] [get_ports {address_4[5]}] [get_ports {address_4[4]}] [get_ports {address_4[3]}] [get_ports {address_4[2]}] [get_ports {address_4[1]}] [get_ports {address_4[0]}] [get_ports {address_3[15]}] [get_ports {address_3[14]}] [get_ports {address_3[13]}] [get_ports {address_3[12]}] [get_ports {address_3[11]}] [get_ports {address_3[10]}] [get_ports {address_3[9]}] [get_ports {address_3[8]}] [get_ports {address_3[7]}] [get_ports {address_3[6]}] [get_ports {address_3[5]}] [get_ports {address_3[4]}] [get_ports {address_3[3]}] [get_ports {address_3[2]}] [get_ports {address_3[1]}] [get_ports {address_3[0]}] [get_ports {address_2[15]}] [get_ports {address_2[14]}] [get_ports {address_2[13]}] [get_ports {address_2[12]}] [get_ports {address_2[11]}] [get_ports {address_2[10]}] [get_ports {address_2[9]}] [get_ports {address_2[8]}] [get_ports {address_2[7]}] [get_ports {address_2[6]}] [get_ports {address_2[5]}] [get_ports {address_2[4]}] [get_ports {address_2[3]}] [get_ports {address_2[2]}] [get_ports {address_2[1]}] [get_ports {address_2[0]}] [get_ports {address_1[15]}] [get_ports {address_1[14]}] [get_ports {address_1[13]}] [get_ports {address_1[12]}] [get_ports {address_1[11]}] [get_ports {address_1[10]}] [get_ports {address_1[9]}] [get_ports {address_1[8]}] [get_ports {address_1[7]}] [get_ports {address_1[6]}] [get_ports {address_1[5]}] [get_ports {address_1[4]}] [get_ports {address_1[3]}] [get_ports {address_1[2]}] [get_ports {address_1[1]}] [get_ports {address_1[0]}] [get_ports {address_0[15]}] [get_ports {address_0[14]}] [get_ports {address_0[13]}] [get_ports {address_0[12]}] [get_ports {address_0[11]}] [get_ports {address_0[10]}] [get_ports {address_0[9]}] [get_ports {address_0[8]}] [get_ports {address_0[7]}] [get_ports {address_0[6]}] [get_ports {address_0[5]}] [get_ports {address_0[4]}] [get_ports {address_0[3]}] [get_ports {address_0[2]}] [get_ports {address_0[1]}] [get_ports {address_0[0]}] [get_ports write_read_7] [get_ports write_read_6] [get_ports write_read_5] [get_ports write_read_4] [get_ports write_read_3] [get_ports write_read_2] [get_ports write_read_1] [get_ports write_read_0] [get_ports {wdata_7[63]}] [get_ports {wdata_7[62]}] [get_ports {wdata_7[61]}] [get_ports {wdata_7[60]}] [get_ports {wdata_7[59]}] [get_ports {wdata_7[58]}] [get_ports {wdata_7[57]}] [get_ports {wdata_7[56]}] [get_ports {wdata_7[55]}] [get_ports {wdata_7[54]}] [get_ports {wdata_7[53]}] [get_ports {wdata_7[52]}] [get_ports {wdata_7[51]}] [get_ports {wdata_7[50]}] [get_ports {wdata_7[49]}] [get_ports {wdata_7[48]}] [get_ports {wdata_7[47]}] [get_ports {wdata_7[46]}] [get_ports {wdata_7[45]}] [get_ports {wdata_7[44]}] [get_ports {wdata_7[43]}] [get_ports {wdata_7[42]}] [get_ports {wdata_7[41]}] [get_ports {wdata_7[40]}] [get_ports {wdata_7[39]}] [get_ports {wdata_7[38]}] [get_ports {wdata_7[37]}] [get_ports {wdata_7[36]}] [get_ports {wdata_7[35]}] [get_ports {wdata_7[34]}] [get_ports {wdata_7[33]}] [get_ports {wdata_7[32]}] [get_ports {wdata_7[31]}] [get_ports {wdata_7[30]}] [get_ports {wdata_7[29]}] [get_ports {wdata_7[28]}] [get_ports {wdata_7[27]}] [get_ports {wdata_7[26]}] [get_ports {wdata_7[25]}] [get_ports {wdata_7[24]}] [get_ports {wdata_7[23]}] [get_ports {wdata_7[22]}] [get_ports {wdata_7[21]}] [get_ports {wdata_7[20]}] [get_ports {wdata_7[19]}] [get_ports {wdata_7[18]}] [get_ports {wdata_7[17]}] [get_ports {wdata_7[16]}] [get_ports {wdata_7[15]}] [get_ports {wdata_7[14]}] [get_ports {wdata_7[13]}] [get_ports {wdata_7[12]}] [get_ports {wdata_7[11]}] [get_ports {wdata_7[10]}] [get_ports {wdata_7[9]}] [get_ports {wdata_7[8]}] [get_ports {wdata_7[7]}] [get_ports {wdata_7[6]}] [get_ports {wdata_7[5]}] [get_ports {wdata_7[4]}] [get_ports {wdata_7[3]}] [get_ports {wdata_7[2]}] [get_ports {wdata_7[1]}] [get_ports {wdata_7[0]}] [get_ports {wdata_6[63]}] [get_ports {wdata_6[62]}] [get_ports {wdata_6[61]}] [get_ports {wdata_6[60]}] [get_ports {wdata_6[59]}] [get_ports {wdata_6[58]}] [get_ports {wdata_6[57]}] [get_ports {wdata_6[56]}] [get_ports {wdata_6[55]}] [get_ports {wdata_6[54]}] [get_ports {wdata_6[53]}] [get_ports {wdata_6[52]}] [get_ports {wdata_6[51]}] [get_ports {wdata_6[50]}] [get_ports {wdata_6[49]}] [get_ports {wdata_6[48]}] [get_ports {wdata_6[47]}] [get_ports {wdata_6[46]}] [get_ports {wdata_6[45]}] [get_ports {wdata_6[44]}] [get_ports {wdata_6[43]}] [get_ports {wdata_6[42]}] [get_ports {wdata_6[41]}] [get_ports {wdata_6[40]}] [get_ports {wdata_6[39]}] [get_ports {wdata_6[38]}] [get_ports {wdata_6[37]}] [get_ports {wdata_6[36]}] [get_ports {wdata_6[35]}] [get_ports {wdata_6[34]}] [get_ports {wdata_6[33]}] [get_ports {wdata_6[32]}] [get_ports {wdata_6[31]}] [get_ports {wdata_6[30]}] [get_ports {wdata_6[29]}] [get_ports {wdata_6[28]}] [get_ports {wdata_6[27]}] [get_ports {wdata_6[26]}] [get_ports {wdata_6[25]}] [get_ports {wdata_6[24]}] [get_ports {wdata_6[23]}] [get_ports {wdata_6[22]}] [get_ports {wdata_6[21]}] [get_ports {wdata_6[20]}] [get_ports {wdata_6[19]}] [get_ports {wdata_6[18]}] [get_ports {wdata_6[17]}] [get_ports {wdata_6[16]}] [get_ports {wdata_6[15]}] [get_ports {wdata_6[14]}] [get_ports {wdata_6[13]}] [get_ports {wdata_6[12]}] [get_ports {wdata_6[11]}] [get_ports {wdata_6[10]}] [get_ports {wdata_6[9]}] [get_ports {wdata_6[8]}] [get_ports {wdata_6[7]}] [get_ports {wdata_6[6]}] [get_ports {wdata_6[5]}] [get_ports {wdata_6[4]}] [get_ports {wdata_6[3]}] [get_ports {wdata_6[2]}] [get_ports {wdata_6[1]}] [get_ports {wdata_6[0]}] [get_ports {wdata_5[63]}] [get_ports {wdata_5[62]}] [get_ports {wdata_5[61]}] [get_ports {wdata_5[60]}] [get_ports {wdata_5[59]}] [get_ports {wdata_5[58]}] [get_ports {wdata_5[57]}] [get_ports {wdata_5[56]}] [get_ports {wdata_5[55]}] [get_ports {wdata_5[54]}] [get_ports {wdata_5[53]}] [get_ports {wdata_5[52]}] [get_ports {wdata_5[51]}] [get_ports {wdata_5[50]}] [get_ports {wdata_5[49]}] [get_ports {wdata_5[48]}] [get_ports {wdata_5[47]}] [get_ports {wdata_5[46]}] [get_ports {wdata_5[45]}] [get_ports {wdata_5[44]}] [get_ports {wdata_5[43]}] [get_ports {wdata_5[42]}] [get_ports {wdata_5[41]}] [get_ports {wdata_5[40]}] [get_ports {wdata_5[39]}] [get_ports {wdata_5[38]}] [get_ports {wdata_5[37]}] [get_ports {wdata_5[36]}] [get_ports {wdata_5[35]}] [get_ports {wdata_5[34]}] [get_ports {wdata_5[33]}] [get_ports {wdata_5[32]}] [get_ports {wdata_5[31]}] [get_ports {wdata_5[30]}] [get_ports {wdata_5[29]}] [get_ports {wdata_5[28]}] [get_ports {wdata_5[27]}] [get_ports {wdata_5[26]}] [get_ports {wdata_5[25]}] [get_ports {wdata_5[24]}] [get_ports {wdata_5[23]}] [get_ports {wdata_5[22]}] [get_ports {wdata_5[21]}] [get_ports {wdata_5[20]}] [get_ports {wdata_5[19]}] [get_ports {wdata_5[18]}] [get_ports {wdata_5[17]}] [get_ports {wdata_5[16]}] [get_ports {wdata_5[15]}] [get_ports {wdata_5[14]}] [get_ports {wdata_5[13]}] [get_ports {wdata_5[12]}] [get_ports {wdata_5[11]}] [get_ports {wdata_5[10]}] [get_ports {wdata_5[9]}] [get_ports {wdata_5[8]}] [get_ports {wdata_5[7]}] [get_ports {wdata_5[6]}] [get_ports {wdata_5[5]}] [get_ports {wdata_5[4]}] [get_ports {wdata_5[3]}] [get_ports {wdata_5[2]}] [get_ports {wdata_5[1]}] [get_ports {wdata_5[0]}] [get_ports {wdata_4[63]}] [get_ports {wdata_4[62]}] [get_ports {wdata_4[61]}] [get_ports {wdata_4[60]}] [get_ports {wdata_4[59]}] [get_ports {wdata_4[58]}] [get_ports {wdata_4[57]}] [get_ports {wdata_4[56]}] [get_ports {wdata_4[55]}] [get_ports {wdata_4[54]}] [get_ports {wdata_4[53]}] [get_ports {wdata_4[52]}] [get_ports {wdata_4[51]}] [get_ports {wdata_4[50]}] [get_ports {wdata_4[49]}] [get_ports {wdata_4[48]}] [get_ports {wdata_4[47]}] [get_ports {wdata_4[46]}] [get_ports {wdata_4[45]}] [get_ports {wdata_4[44]}] [get_ports {wdata_4[43]}] [get_ports {wdata_4[42]}] [get_ports {wdata_4[41]}] [get_ports {wdata_4[40]}] [get_ports {wdata_4[39]}] [get_ports {wdata_4[38]}] [get_ports {wdata_4[37]}] [get_ports {wdata_4[36]}] [get_ports {wdata_4[35]}] [get_ports {wdata_4[34]}] [get_ports {wdata_4[33]}] [get_ports {wdata_4[32]}] [get_ports {wdata_4[31]}] [get_ports {wdata_4[30]}] [get_ports {wdata_4[29]}] [get_ports {wdata_4[28]}] [get_ports {wdata_4[27]}] [get_ports {wdata_4[26]}] [get_ports {wdata_4[25]}] [get_ports {wdata_4[24]}] [get_ports {wdata_4[23]}] [get_ports {wdata_4[22]}] [get_ports {wdata_4[21]}] [get_ports {wdata_4[20]}] [get_ports {wdata_4[19]}] [get_ports {wdata_4[18]}] [get_ports {wdata_4[17]}] [get_ports {wdata_4[16]}] [get_ports {wdata_4[15]}] [get_ports {wdata_4[14]}] [get_ports {wdata_4[13]}] [get_ports {wdata_4[12]}] [get_ports {wdata_4[11]}] [get_ports {wdata_4[10]}] [get_ports {wdata_4[9]}] [get_ports {wdata_4[8]}] [get_ports {wdata_4[7]}] [get_ports {wdata_4[6]}] [get_ports {wdata_4[5]}] [get_ports {wdata_4[4]}] [get_ports {wdata_4[3]}] [get_ports {wdata_4[2]}] [get_ports {wdata_4[1]}] [get_ports {wdata_4[0]}] [get_ports {wdata_3[63]}] [get_ports {wdata_3[62]}] [get_ports {wdata_3[61]}] [get_ports {wdata_3[60]}] [get_ports {wdata_3[59]}] [get_ports {wdata_3[58]}] [get_ports {wdata_3[57]}] [get_ports {wdata_3[56]}] [get_ports {wdata_3[55]}] [get_ports {wdata_3[54]}] [get_ports {wdata_3[53]}] [get_ports {wdata_3[52]}] [get_ports {wdata_3[51]}] [get_ports {wdata_3[50]}] [get_ports {wdata_3[49]}] [get_ports {wdata_3[48]}] [get_ports {wdata_3[47]}] [get_ports {wdata_3[46]}] [get_ports {wdata_3[45]}] [get_ports {wdata_3[44]}] [get_ports {wdata_3[43]}] [get_ports {wdata_3[42]}] [get_ports {wdata_3[41]}] [get_ports {wdata_3[40]}] [get_ports {wdata_3[39]}] [get_ports {wdata_3[38]}] [get_ports {wdata_3[37]}] [get_ports {wdata_3[36]}] [get_ports {wdata_3[35]}] [get_ports {wdata_3[34]}] [get_ports {wdata_3[33]}] [get_ports {wdata_3[32]}] [get_ports {wdata_3[31]}] [get_ports {wdata_3[30]}] [get_ports {wdata_3[29]}] [get_ports {wdata_3[28]}] [get_ports {wdata_3[27]}] [get_ports {wdata_3[26]}] [get_ports {wdata_3[25]}] [get_ports {wdata_3[24]}] [get_ports {wdata_3[23]}] [get_ports {wdata_3[22]}] [get_ports {wdata_3[21]}] [get_ports {wdata_3[20]}] [get_ports {wdata_3[19]}] [get_ports {wdata_3[18]}] [get_ports {wdata_3[17]}] [get_ports {wdata_3[16]}] [get_ports {wdata_3[15]}] [get_ports {wdata_3[14]}] [get_ports {wdata_3[13]}] [get_ports {wdata_3[12]}] [get_ports {wdata_3[11]}] [get_ports {wdata_3[10]}] [get_ports {wdata_3[9]}] [get_ports {wdata_3[8]}] [get_ports {wdata_3[7]}] [get_ports {wdata_3[6]}] [get_ports {wdata_3[5]}] [get_ports {wdata_3[4]}] [get_ports {wdata_3[3]}] [get_ports {wdata_3[2]}] [get_ports {wdata_3[1]}] [get_ports {wdata_3[0]}] [get_ports {wdata_2[63]}] [get_ports {wdata_2[62]}] [get_ports {wdata_2[61]}] [get_ports {wdata_2[60]}] [get_ports {wdata_2[59]}] [get_ports {wdata_2[58]}] [get_ports {wdata_2[57]}] [get_ports {wdata_2[56]}] [get_ports {wdata_2[55]}] [get_ports {wdata_2[54]}] [get_ports {wdata_2[53]}] [get_ports {wdata_2[52]}] [get_ports {wdata_2[51]}] [get_ports {wdata_2[50]}] [get_ports {wdata_2[49]}] [get_ports {wdata_2[48]}] [get_ports {wdata_2[47]}] [get_ports {wdata_2[46]}] [get_ports {wdata_2[45]}] [get_ports {wdata_2[44]}] [get_ports {wdata_2[43]}] [get_ports {wdata_2[42]}] [get_ports {wdata_2[41]}] [get_ports {wdata_2[40]}] [get_ports {wdata_2[39]}] [get_ports {wdata_2[38]}] [get_ports {wdata_2[37]}] [get_ports {wdata_2[36]}] [get_ports {wdata_2[35]}] [get_ports {wdata_2[34]}] [get_ports {wdata_2[33]}] [get_ports {wdata_2[32]}] [get_ports {wdata_2[31]}] [get_ports {wdata_2[30]}] [get_ports {wdata_2[29]}] [get_ports {wdata_2[28]}] [get_ports {wdata_2[27]}] [get_ports {wdata_2[26]}] [get_ports {wdata_2[25]}] [get_ports {wdata_2[24]}] [get_ports {wdata_2[23]}] [get_ports {wdata_2[22]}] [get_ports {wdata_2[21]}] [get_ports {wdata_2[20]}] [get_ports {wdata_2[19]}] [get_ports {wdata_2[18]}] [get_ports {wdata_2[17]}] [get_ports {wdata_2[16]}] [get_ports {wdata_2[15]}] [get_ports {wdata_2[14]}] [get_ports {wdata_2[13]}] [get_ports {wdata_2[12]}] [get_ports {wdata_2[11]}] [get_ports {wdata_2[10]}] [get_ports {wdata_2[9]}] [get_ports {wdata_2[8]}] [get_ports {wdata_2[7]}] [get_ports {wdata_2[6]}] [get_ports {wdata_2[5]}] [get_ports {wdata_2[4]}] [get_ports {wdata_2[3]}] [get_ports {wdata_2[2]}] [get_ports {wdata_2[1]}] [get_ports {wdata_2[0]}] [get_ports {wdata_1[63]}] [get_ports {wdata_1[62]}] [get_ports {wdata_1[61]}] [get_ports {wdata_1[60]}] [get_ports {wdata_1[59]}] [get_ports {wdata_1[58]}] [get_ports {wdata_1[57]}] [get_ports {wdata_1[56]}] [get_ports {wdata_1[55]}] [get_ports {wdata_1[54]}] [get_ports {wdata_1[53]}] [get_ports {wdata_1[52]}] [get_ports {wdata_1[51]}] [get_ports {wdata_1[50]}] [get_ports {wdata_1[49]}] [get_ports {wdata_1[48]}] [get_ports {wdata_1[47]}] [get_ports {wdata_1[46]}] [get_ports {wdata_1[45]}] [get_ports {wdata_1[44]}] [get_ports {wdata_1[43]}] [get_ports {wdata_1[42]}] [get_ports {wdata_1[41]}] [get_ports {wdata_1[40]}] [get_ports {wdata_1[39]}] [get_ports {wdata_1[38]}] [get_ports {wdata_1[37]}] [get_ports {wdata_1[36]}] [get_ports {wdata_1[35]}] [get_ports {wdata_1[34]}] [get_ports {wdata_1[33]}] [get_ports {wdata_1[32]}] [get_ports {wdata_1[31]}] [get_ports {wdata_1[30]}] [get_ports {wdata_1[29]}] [get_ports {wdata_1[28]}] [get_ports {wdata_1[27]}] [get_ports {wdata_1[26]}] [get_ports {wdata_1[25]}] [get_ports {wdata_1[24]}] [get_ports {wdata_1[23]}] [get_ports {wdata_1[22]}] [get_ports {wdata_1[21]}] [get_ports {wdata_1[20]}] [get_ports {wdata_1[19]}] [get_ports {wdata_1[18]}] [get_ports {wdata_1[17]}] [get_ports {wdata_1[16]}] [get_ports {wdata_1[15]}] [get_ports {wdata_1[14]}] [get_ports {wdata_1[13]}] [get_ports {wdata_1[12]}] [get_ports {wdata_1[11]}] [get_ports {wdata_1[10]}] [get_ports {wdata_1[9]}] [get_ports {wdata_1[8]}] [get_ports {wdata_1[7]}] [get_ports {wdata_1[6]}] [get_ports {wdata_1[5]}] [get_ports {wdata_1[4]}] [get_ports {wdata_1[3]}] [get_ports {wdata_1[2]}] [get_ports {wdata_1[1]}] [get_ports {wdata_1[0]}] [get_ports {wdata_0[63]}] [get_ports {wdata_0[62]}] [get_ports {wdata_0[61]}] [get_ports {wdata_0[60]}] [get_ports {wdata_0[59]}] [get_ports {wdata_0[58]}] [get_ports {wdata_0[57]}] [get_ports {wdata_0[56]}] [get_ports {wdata_0[55]}] [get_ports {wdata_0[54]}] [get_ports {wdata_0[53]}] [get_ports {wdata_0[52]}] [get_ports {wdata_0[51]}] [get_ports {wdata_0[50]}] [get_ports {wdata_0[49]}] [get_ports {wdata_0[48]}] [get_ports {wdata_0[47]}] [get_ports {wdata_0[46]}] [get_ports {wdata_0[45]}] [get_ports {wdata_0[44]}] [get_ports {wdata_0[43]}] [get_ports {wdata_0[42]}] [get_ports {wdata_0[41]}] [get_ports {wdata_0[40]}] [get_ports {wdata_0[39]}] [get_ports {wdata_0[38]}] [get_ports {wdata_0[37]}] [get_ports {wdata_0[36]}] [get_ports {wdata_0[35]}] [get_ports {wdata_0[34]}] [get_ports {wdata_0[33]}] [get_ports {wdata_0[32]}] [get_ports {wdata_0[31]}] [get_ports {wdata_0[30]}] [get_ports {wdata_0[29]}] [get_ports {wdata_0[28]}] [get_ports {wdata_0[27]}] [get_ports {wdata_0[26]}] [get_ports {wdata_0[25]}] [get_ports {wdata_0[24]}] [get_ports {wdata_0[23]}] [get_ports {wdata_0[22]}] [get_ports {wdata_0[21]}] [get_ports {wdata_0[20]}] [get_ports {wdata_0[19]}] [get_ports {wdata_0[18]}] [get_ports {wdata_0[17]}] [get_ports {wdata_0[16]}] [get_ports {wdata_0[15]}] [get_ports {wdata_0[14]}] [get_ports {wdata_0[13]}] [get_ports {wdata_0[12]}] [get_ports {wdata_0[11]}] [get_ports {wdata_0[10]}] [get_ports {wdata_0[9]}] [get_ports {wdata_0[8]}] [get_ports {wdata_0[7]}] [get_ports {wdata_0[6]}] [get_ports {wdata_0[5]}] [get_ports {wdata_0[4]}] [get_ports {wdata_0[3]}] [get_ports {wdata_0[2]}] [get_ports {wdata_0[1]}] [get_ports {wdata_0[0]}] [get_ports error] [get_ports force_terminate] [get_ports complete]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports test_mode] [get_ports {operation[2]}] [get_ports {operation[1]}] [get_ports {operation[0]}] [get_ports error_exceed_ignore] [get_ports {allowable_faulty[15]}] [get_ports {allowable_faulty[14]}] [get_ports {allowable_faulty[13]}] [get_ports {allowable_faulty[12]}] [get_ports {allowable_faulty[11]}] [get_ports {allowable_faulty[10]}] [get_ports {allowable_faulty[9]}] [get_ports {allowable_faulty[8]}] [get_ports {allowable_faulty[7]}] [get_ports {allowable_faulty[6]}] [get_ports {allowable_faulty[5]}] [get_ports {allowable_faulty[4]}] [get_ports {allowable_faulty[3]}] [get_ports {allowable_faulty[2]}] [get_ports {allowable_faulty[1]}] [get_ports {allowable_faulty[0]}] [get_ports {memory_sel[2]}] [get_ports {memory_sel[1]}] [get_ports {memory_sel[0]}] [get_ports {memtype[4]}] [get_ports {memtype[3]}] [get_ports {memtype[2]}] [get_ports {memtype[1]}] [get_ports {memtype[0]}] [get_ports {rdata_7[63]}] [get_ports {rdata_7[62]}] [get_ports {rdata_7[61]}] [get_ports {rdata_7[60]}] [get_ports {rdata_7[59]}] [get_ports {rdata_7[58]}] [get_ports {rdata_7[57]}] [get_ports {rdata_7[56]}] [get_ports {rdata_7[55]}] [get_ports {rdata_7[54]}] [get_ports {rdata_7[53]}] [get_ports {rdata_7[52]}] [get_ports {rdata_7[51]}] [get_ports {rdata_7[50]}] [get_ports {rdata_7[49]}] [get_ports {rdata_7[48]}] [get_ports {rdata_7[47]}] [get_ports {rdata_7[46]}] [get_ports {rdata_7[45]}] [get_ports {rdata_7[44]}] [get_ports {rdata_7[43]}] [get_ports {rdata_7[42]}] [get_ports {rdata_7[41]}] [get_ports {rdata_7[40]}] [get_ports {rdata_7[39]}] [get_ports {rdata_7[38]}] [get_ports {rdata_7[37]}] [get_ports {rdata_7[36]}] [get_ports {rdata_7[35]}] [get_ports {rdata_7[34]}] [get_ports {rdata_7[33]}] [get_ports {rdata_7[32]}] [get_ports {rdata_7[31]}] [get_ports {rdata_7[30]}] [get_ports {rdata_7[29]}] [get_ports {rdata_7[28]}] [get_ports {rdata_7[27]}] [get_ports {rdata_7[26]}] [get_ports {rdata_7[25]}] [get_ports {rdata_7[24]}] [get_ports {rdata_7[23]}] [get_ports {rdata_7[22]}] [get_ports {rdata_7[21]}] [get_ports {rdata_7[20]}] [get_ports {rdata_7[19]}] [get_ports {rdata_7[18]}] [get_ports {rdata_7[17]}] [get_ports {rdata_7[16]}] [get_ports {rdata_7[15]}] [get_ports {rdata_7[14]}] [get_ports {rdata_7[13]}] [get_ports {rdata_7[12]}] [get_ports {rdata_7[11]}] [get_ports {rdata_7[10]}] [get_ports {rdata_7[9]}] [get_ports {rdata_7[8]}] [get_ports {rdata_7[7]}] [get_ports {rdata_7[6]}] [get_ports {rdata_7[5]}] [get_ports {rdata_7[4]}] [get_ports {rdata_7[3]}] [get_ports {rdata_7[2]}] [get_ports {rdata_7[1]}] [get_ports {rdata_7[0]}] [get_ports {rdata_6[63]}] [get_ports {rdata_6[62]}] [get_ports {rdata_6[61]}] [get_ports {rdata_6[60]}] [get_ports {rdata_6[59]}] [get_ports {rdata_6[58]}] [get_ports {rdata_6[57]}] [get_ports {rdata_6[56]}] [get_ports {rdata_6[55]}] [get_ports {rdata_6[54]}] [get_ports {rdata_6[53]}] [get_ports {rdata_6[52]}] [get_ports {rdata_6[51]}] [get_ports {rdata_6[50]}] [get_ports {rdata_6[49]}] [get_ports {rdata_6[48]}] [get_ports {rdata_6[47]}] [get_ports {rdata_6[46]}] [get_ports {rdata_6[45]}] [get_ports {rdata_6[44]}] [get_ports {rdata_6[43]}] [get_ports {rdata_6[42]}] [get_ports {rdata_6[41]}] [get_ports {rdata_6[40]}] [get_ports {rdata_6[39]}] [get_ports {rdata_6[38]}] [get_ports {rdata_6[37]}] [get_ports {rdata_6[36]}] [get_ports {rdata_6[35]}] [get_ports {rdata_6[34]}] [get_ports {rdata_6[33]}] [get_ports {rdata_6[32]}] [get_ports {rdata_6[31]}] [get_ports {rdata_6[30]}] [get_ports {rdata_6[29]}] [get_ports {rdata_6[28]}] [get_ports {rdata_6[27]}] [get_ports {rdata_6[26]}] [get_ports {rdata_6[25]}] [get_ports {rdata_6[24]}] [get_ports {rdata_6[23]}] [get_ports {rdata_6[22]}] [get_ports {rdata_6[21]}] [get_ports {rdata_6[20]}] [get_ports {rdata_6[19]}] [get_ports {rdata_6[18]}] [get_ports {rdata_6[17]}] [get_ports {rdata_6[16]}] [get_ports {rdata_6[15]}] [get_ports {rdata_6[14]}] [get_ports {rdata_6[13]}] [get_ports {rdata_6[12]}] [get_ports {rdata_6[11]}] [get_ports {rdata_6[10]}] [get_ports {rdata_6[9]}] [get_ports {rdata_6[8]}] [get_ports {rdata_6[7]}] [get_ports {rdata_6[6]}] [get_ports {rdata_6[5]}] [get_ports {rdata_6[4]}] [get_ports {rdata_6[3]}] [get_ports {rdata_6[2]}] [get_ports {rdata_6[1]}] [get_ports {rdata_6[0]}] [get_ports {rdata_5[63]}] [get_ports {rdata_5[62]}] [get_ports {rdata_5[61]}] [get_ports {rdata_5[60]}] [get_ports {rdata_5[59]}] [get_ports {rdata_5[58]}] [get_ports {rdata_5[57]}] [get_ports {rdata_5[56]}] [get_ports {rdata_5[55]}] [get_ports {rdata_5[54]}] [get_ports {rdata_5[53]}] [get_ports {rdata_5[52]}] [get_ports {rdata_5[51]}] [get_ports {rdata_5[50]}] [get_ports {rdata_5[49]}] [get_ports {rdata_5[48]}] [get_ports {rdata_5[47]}] [get_ports {rdata_5[46]}] [get_ports {rdata_5[45]}] [get_ports {rdata_5[44]}] [get_ports {rdata_5[43]}] [get_ports {rdata_5[42]}] [get_ports {rdata_5[41]}] [get_ports {rdata_5[40]}] [get_ports {rdata_5[39]}] [get_ports {rdata_5[38]}] [get_ports {rdata_5[37]}] [get_ports {rdata_5[36]}] [get_ports {rdata_5[35]}] [get_ports {rdata_5[34]}] [get_ports {rdata_5[33]}] [get_ports {rdata_5[32]}] [get_ports {rdata_5[31]}] [get_ports {rdata_5[30]}] [get_ports {rdata_5[29]}] [get_ports {rdata_5[28]}] [get_ports {rdata_5[27]}] [get_ports {rdata_5[26]}] [get_ports {rdata_5[25]}] [get_ports {rdata_5[24]}] [get_ports {rdata_5[23]}] [get_ports {rdata_5[22]}] [get_ports {rdata_5[21]}] [get_ports {rdata_5[20]}] [get_ports {rdata_5[19]}] [get_ports {rdata_5[18]}] [get_ports {rdata_5[17]}] [get_ports {rdata_5[16]}] [get_ports {rdata_5[15]}] [get_ports {rdata_5[14]}] [get_ports {rdata_5[13]}] [get_ports {rdata_5[12]}] [get_ports {rdata_5[11]}] [get_ports {rdata_5[10]}] [get_ports {rdata_5[9]}] [get_ports {rdata_5[8]}] [get_ports {rdata_5[7]}] [get_ports {rdata_5[6]}] [get_ports {rdata_5[5]}] [get_ports {rdata_5[4]}] [get_ports {rdata_5[3]}] [get_ports {rdata_5[2]}] [get_ports {rdata_5[1]}] [get_ports {rdata_5[0]}] [get_ports {rdata_4[63]}] [get_ports {rdata_4[62]}] [get_ports {rdata_4[61]}] [get_ports {rdata_4[60]}] [get_ports {rdata_4[59]}] [get_ports {rdata_4[58]}] [get_ports {rdata_4[57]}] [get_ports {rdata_4[56]}] [get_ports {rdata_4[55]}] [get_ports {rdata_4[54]}] [get_ports {rdata_4[53]}] [get_ports {rdata_4[52]}] [get_ports {rdata_4[51]}] [get_ports {rdata_4[50]}] [get_ports {rdata_4[49]}] [get_ports {rdata_4[48]}] [get_ports {rdata_4[47]}] [get_ports {rdata_4[46]}] [get_ports {rdata_4[45]}] [get_ports {rdata_4[44]}] [get_ports {rdata_4[43]}] [get_ports {rdata_4[42]}] [get_ports {rdata_4[41]}] [get_ports {rdata_4[40]}] [get_ports {rdata_4[39]}] [get_ports {rdata_4[38]}] [get_ports {rdata_4[37]}] [get_ports {rdata_4[36]}] [get_ports {rdata_4[35]}] [get_ports {rdata_4[34]}] [get_ports {rdata_4[33]}] [get_ports {rdata_4[32]}] [get_ports {rdata_4[31]}] [get_ports {rdata_4[30]}] [get_ports {rdata_4[29]}] [get_ports {rdata_4[28]}] [get_ports {rdata_4[27]}] [get_ports {rdata_4[26]}] [get_ports {rdata_4[25]}] [get_ports {rdata_4[24]}] [get_ports {rdata_4[23]}] [get_ports {rdata_4[22]}] [get_ports {rdata_4[21]}] [get_ports {rdata_4[20]}] [get_ports {rdata_4[19]}] [get_ports {rdata_4[18]}] [get_ports {rdata_4[17]}] [get_ports {rdata_4[16]}] [get_ports {rdata_4[15]}] [get_ports {rdata_4[14]}] [get_ports {rdata_4[13]}] [get_ports {rdata_4[12]}] [get_ports {rdata_4[11]}] [get_ports {rdata_4[10]}] [get_ports {rdata_4[9]}] [get_ports {rdata_4[8]}] [get_ports {rdata_4[7]}] [get_ports {rdata_4[6]}] [get_ports {rdata_4[5]}] [get_ports {rdata_4[4]}] [get_ports {rdata_4[3]}] [get_ports {rdata_4[2]}] [get_ports {rdata_4[1]}] [get_ports {rdata_4[0]}] [get_ports {rdata_3[63]}] [get_ports {rdata_3[62]}] [get_ports {rdata_3[61]}] [get_ports {rdata_3[60]}] [get_ports {rdata_3[59]}] [get_ports {rdata_3[58]}] [get_ports {rdata_3[57]}] [get_ports {rdata_3[56]}] [get_ports {rdata_3[55]}] [get_ports {rdata_3[54]}] [get_ports {rdata_3[53]}] [get_ports {rdata_3[52]}] [get_ports {rdata_3[51]}] [get_ports {rdata_3[50]}] [get_ports {rdata_3[49]}] [get_ports {rdata_3[48]}] [get_ports {rdata_3[47]}] [get_ports {rdata_3[46]}] [get_ports {rdata_3[45]}] [get_ports {rdata_3[44]}] [get_ports {rdata_3[43]}] [get_ports {rdata_3[42]}] [get_ports {rdata_3[41]}] [get_ports {rdata_3[40]}] [get_ports {rdata_3[39]}] [get_ports {rdata_3[38]}] [get_ports {rdata_3[37]}] [get_ports {rdata_3[36]}] [get_ports {rdata_3[35]}] [get_ports {rdata_3[34]}] [get_ports {rdata_3[33]}] [get_ports {rdata_3[32]}] [get_ports {rdata_3[31]}] [get_ports {rdata_3[30]}] [get_ports {rdata_3[29]}] [get_ports {rdata_3[28]}] [get_ports {rdata_3[27]}] [get_ports {rdata_3[26]}] [get_ports {rdata_3[25]}] [get_ports {rdata_3[24]}] [get_ports {rdata_3[23]}] [get_ports {rdata_3[22]}] [get_ports {rdata_3[21]}] [get_ports {rdata_3[20]}] [get_ports {rdata_3[19]}] [get_ports {rdata_3[18]}] [get_ports {rdata_3[17]}] [get_ports {rdata_3[16]}] [get_ports {rdata_3[15]}] [get_ports {rdata_3[14]}] [get_ports {rdata_3[13]}] [get_ports {rdata_3[12]}] [get_ports {rdata_3[11]}] [get_ports {rdata_3[10]}] [get_ports {rdata_3[9]}] [get_ports {rdata_3[8]}] [get_ports {rdata_3[7]}] [get_ports {rdata_3[6]}] [get_ports {rdata_3[5]}] [get_ports {rdata_3[4]}] [get_ports {rdata_3[3]}] [get_ports {rdata_3[2]}] [get_ports {rdata_3[1]}] [get_ports {rdata_3[0]}] [get_ports {rdata_2[63]}] [get_ports {rdata_2[62]}] [get_ports {rdata_2[61]}] [get_ports {rdata_2[60]}] [get_ports {rdata_2[59]}] [get_ports {rdata_2[58]}] [get_ports {rdata_2[57]}] [get_ports {rdata_2[56]}] [get_ports {rdata_2[55]}] [get_ports {rdata_2[54]}] [get_ports {rdata_2[53]}] [get_ports {rdata_2[52]}] [get_ports {rdata_2[51]}] [get_ports {rdata_2[50]}] [get_ports {rdata_2[49]}] [get_ports {rdata_2[48]}] [get_ports {rdata_2[47]}] [get_ports {rdata_2[46]}] [get_ports {rdata_2[45]}] [get_ports {rdata_2[44]}] [get_ports {rdata_2[43]}] [get_ports {rdata_2[42]}] [get_ports {rdata_2[41]}] [get_ports {rdata_2[40]}] [get_ports {rdata_2[39]}] [get_ports {rdata_2[38]}] [get_ports {rdata_2[37]}] [get_ports {rdata_2[36]}] [get_ports {rdata_2[35]}] [get_ports {rdata_2[34]}] [get_ports {rdata_2[33]}] [get_ports {rdata_2[32]}] [get_ports {rdata_2[31]}] [get_ports {rdata_2[30]}] [get_ports {rdata_2[29]}] [get_ports {rdata_2[28]}] [get_ports {rdata_2[27]}] [get_ports {rdata_2[26]}] [get_ports {rdata_2[25]}] [get_ports {rdata_2[24]}] [get_ports {rdata_2[23]}] [get_ports {rdata_2[22]}] [get_ports {rdata_2[21]}] [get_ports {rdata_2[20]}] [get_ports {rdata_2[19]}] [get_ports {rdata_2[18]}] [get_ports {rdata_2[17]}] [get_ports {rdata_2[16]}] [get_ports {rdata_2[15]}] [get_ports {rdata_2[14]}] [get_ports {rdata_2[13]}] [get_ports {rdata_2[12]}] [get_ports {rdata_2[11]}] [get_ports {rdata_2[10]}] [get_ports {rdata_2[9]}] [get_ports {rdata_2[8]}] [get_ports {rdata_2[7]}] [get_ports {rdata_2[6]}] [get_ports {rdata_2[5]}] [get_ports {rdata_2[4]}] [get_ports {rdata_2[3]}] [get_ports {rdata_2[2]}] [get_ports {rdata_2[1]}] [get_ports {rdata_2[0]}] [get_ports {rdata_1[63]}] [get_ports {rdata_1[62]}] [get_ports {rdata_1[61]}] [get_ports {rdata_1[60]}] [get_ports {rdata_1[59]}] [get_ports {rdata_1[58]}] [get_ports {rdata_1[57]}] [get_ports {rdata_1[56]}] [get_ports {rdata_1[55]}] [get_ports {rdata_1[54]}] [get_ports {rdata_1[53]}] [get_ports {rdata_1[52]}] [get_ports {rdata_1[51]}] [get_ports {rdata_1[50]}] [get_ports {rdata_1[49]}] [get_ports {rdata_1[48]}] [get_ports {rdata_1[47]}] [get_ports {rdata_1[46]}] [get_ports {rdata_1[45]}] [get_ports {rdata_1[44]}] [get_ports {rdata_1[43]}] [get_ports {rdata_1[42]}] [get_ports {rdata_1[41]}] [get_ports {rdata_1[40]}] [get_ports {rdata_1[39]}] [get_ports {rdata_1[38]}] [get_ports {rdata_1[37]}] [get_ports {rdata_1[36]}] [get_ports {rdata_1[35]}] [get_ports {rdata_1[34]}] [get_ports {rdata_1[33]}] [get_ports {rdata_1[32]}] [get_ports {rdata_1[31]}] [get_ports {rdata_1[30]}] [get_ports {rdata_1[29]}] [get_ports {rdata_1[28]}] [get_ports {rdata_1[27]}] [get_ports {rdata_1[26]}] [get_ports {rdata_1[25]}] [get_ports {rdata_1[24]}] [get_ports {rdata_1[23]}] [get_ports {rdata_1[22]}] [get_ports {rdata_1[21]}] [get_ports {rdata_1[20]}] [get_ports {rdata_1[19]}] [get_ports {rdata_1[18]}] [get_ports {rdata_1[17]}] [get_ports {rdata_1[16]}] [get_ports {rdata_1[15]}] [get_ports {rdata_1[14]}] [get_ports {rdata_1[13]}] [get_ports {rdata_1[12]}] [get_ports {rdata_1[11]}] [get_ports {rdata_1[10]}] [get_ports {rdata_1[9]}] [get_ports {rdata_1[8]}] [get_ports {rdata_1[7]}] [get_ports {rdata_1[6]}] [get_ports {rdata_1[5]}] [get_ports {rdata_1[4]}] [get_ports {rdata_1[3]}] [get_ports {rdata_1[2]}] [get_ports {rdata_1[1]}] [get_ports {rdata_1[0]}] [get_ports {rdata_0[63]}] [get_ports {rdata_0[62]}] [get_ports {rdata_0[61]}] [get_ports {rdata_0[60]}] [get_ports {rdata_0[59]}] [get_ports {rdata_0[58]}] [get_ports {rdata_0[57]}] [get_ports {rdata_0[56]}] [get_ports {rdata_0[55]}] [get_ports {rdata_0[54]}] [get_ports {rdata_0[53]}] [get_ports {rdata_0[52]}] [get_ports {rdata_0[51]}] [get_ports {rdata_0[50]}] [get_ports {rdata_0[49]}] [get_ports {rdata_0[48]}] [get_ports {rdata_0[47]}] [get_ports {rdata_0[46]}] [get_ports {rdata_0[45]}] [get_ports {rdata_0[44]}] [get_ports {rdata_0[43]}] [get_ports {rdata_0[42]}] [get_ports {rdata_0[41]}] [get_ports {rdata_0[40]}] [get_ports {rdata_0[39]}] [get_ports {rdata_0[38]}] [get_ports {rdata_0[37]}] [get_ports {rdata_0[36]}] [get_ports {rdata_0[35]}] [get_ports {rdata_0[34]}] [get_ports {rdata_0[33]}] [get_ports {rdata_0[32]}] [get_ports {rdata_0[31]}] [get_ports {rdata_0[30]}] [get_ports {rdata_0[29]}] [get_ports {rdata_0[28]}] [get_ports {rdata_0[27]}] [get_ports {rdata_0[26]}] [get_ports {rdata_0[25]}] [get_ports {rdata_0[24]}] [get_ports {rdata_0[23]}] [get_ports {rdata_0[22]}] [get_ports {rdata_0[21]}] [get_ports {rdata_0[20]}] [get_ports {rdata_0[19]}] [get_ports {rdata_0[18]}] [get_ports {rdata_0[17]}] [get_ports {rdata_0[16]}] [get_ports {rdata_0[15]}] [get_ports {rdata_0[14]}] [get_ports {rdata_0[13]}] [get_ports {rdata_0[12]}] [get_ports {rdata_0[11]}] [get_ports {rdata_0[10]}] [get_ports {rdata_0[9]}] [get_ports {rdata_0[8]}] [get_ports {rdata_0[7]}] [get_ports {rdata_0[6]}] [get_ports {rdata_0[5]}] [get_ports {rdata_0[4]}] [get_ports {rdata_0[3]}] [get_ports {rdata_0[2]}] [get_ports {rdata_0[1]}] [get_ports {rdata_0[0]}]]
group_path -name REGOUT  -to [list [get_ports {address_7[15]}] [get_ports {address_7[14]}] [get_ports {address_7[13]}] [get_ports {address_7[12]}] [get_ports {address_7[11]}] [get_ports {address_7[10]}] [get_ports {address_7[9]}] [get_ports {address_7[8]}] [get_ports {address_7[7]}] [get_ports {address_7[6]}] [get_ports {address_7[5]}] [get_ports {address_7[4]}] [get_ports {address_7[3]}] [get_ports {address_7[2]}] [get_ports {address_7[1]}] [get_ports {address_7[0]}] [get_ports {address_6[15]}] [get_ports {address_6[14]}] [get_ports {address_6[13]}] [get_ports {address_6[12]}] [get_ports {address_6[11]}] [get_ports {address_6[10]}] [get_ports {address_6[9]}] [get_ports {address_6[8]}] [get_ports {address_6[7]}] [get_ports {address_6[6]}] [get_ports {address_6[5]}] [get_ports {address_6[4]}] [get_ports {address_6[3]}] [get_ports {address_6[2]}] [get_ports {address_6[1]}] [get_ports {address_6[0]}] [get_ports {address_5[15]}] [get_ports {address_5[14]}] [get_ports {address_5[13]}] [get_ports {address_5[12]}] [get_ports {address_5[11]}] [get_ports {address_5[10]}] [get_ports {address_5[9]}] [get_ports {address_5[8]}] [get_ports {address_5[7]}] [get_ports {address_5[6]}] [get_ports {address_5[5]}] [get_ports {address_5[4]}] [get_ports {address_5[3]}] [get_ports {address_5[2]}] [get_ports {address_5[1]}] [get_ports {address_5[0]}] [get_ports {address_4[15]}] [get_ports {address_4[14]}] [get_ports {address_4[13]}] [get_ports {address_4[12]}] [get_ports {address_4[11]}] [get_ports {address_4[10]}] [get_ports {address_4[9]}] [get_ports {address_4[8]}] [get_ports {address_4[7]}] [get_ports {address_4[6]}] [get_ports {address_4[5]}] [get_ports {address_4[4]}] [get_ports {address_4[3]}] [get_ports {address_4[2]}] [get_ports {address_4[1]}] [get_ports {address_4[0]}] [get_ports {address_3[15]}] [get_ports {address_3[14]}] [get_ports {address_3[13]}] [get_ports {address_3[12]}] [get_ports {address_3[11]}] [get_ports {address_3[10]}] [get_ports {address_3[9]}] [get_ports {address_3[8]}] [get_ports {address_3[7]}] [get_ports {address_3[6]}] [get_ports {address_3[5]}] [get_ports {address_3[4]}] [get_ports {address_3[3]}] [get_ports {address_3[2]}] [get_ports {address_3[1]}] [get_ports {address_3[0]}] [get_ports {address_2[15]}] [get_ports {address_2[14]}] [get_ports {address_2[13]}] [get_ports {address_2[12]}] [get_ports {address_2[11]}] [get_ports {address_2[10]}] [get_ports {address_2[9]}] [get_ports {address_2[8]}] [get_ports {address_2[7]}] [get_ports {address_2[6]}] [get_ports {address_2[5]}] [get_ports {address_2[4]}] [get_ports {address_2[3]}] [get_ports {address_2[2]}] [get_ports {address_2[1]}] [get_ports {address_2[0]}] [get_ports {address_1[15]}] [get_ports {address_1[14]}] [get_ports {address_1[13]}] [get_ports {address_1[12]}] [get_ports {address_1[11]}] [get_ports {address_1[10]}] [get_ports {address_1[9]}] [get_ports {address_1[8]}] [get_ports {address_1[7]}] [get_ports {address_1[6]}] [get_ports {address_1[5]}] [get_ports {address_1[4]}] [get_ports {address_1[3]}] [get_ports {address_1[2]}] [get_ports {address_1[1]}] [get_ports {address_1[0]}] [get_ports {address_0[15]}] [get_ports {address_0[14]}] [get_ports {address_0[13]}] [get_ports {address_0[12]}] [get_ports {address_0[11]}] [get_ports {address_0[10]}] [get_ports {address_0[9]}] [get_ports {address_0[8]}] [get_ports {address_0[7]}] [get_ports {address_0[6]}] [get_ports {address_0[5]}] [get_ports {address_0[4]}] [get_ports {address_0[3]}] [get_ports {address_0[2]}] [get_ports {address_0[1]}] [get_ports {address_0[0]}] [get_ports write_read_7] [get_ports write_read_6] [get_ports write_read_5] [get_ports write_read_4] [get_ports write_read_3] [get_ports write_read_2] [get_ports write_read_1] [get_ports write_read_0] [get_ports {wdata_7[63]}] [get_ports {wdata_7[62]}] [get_ports {wdata_7[61]}] [get_ports {wdata_7[60]}] [get_ports {wdata_7[59]}] [get_ports {wdata_7[58]}] [get_ports {wdata_7[57]}] [get_ports {wdata_7[56]}] [get_ports {wdata_7[55]}] [get_ports {wdata_7[54]}] [get_ports {wdata_7[53]}] [get_ports {wdata_7[52]}] [get_ports {wdata_7[51]}] [get_ports {wdata_7[50]}] [get_ports {wdata_7[49]}] [get_ports {wdata_7[48]}] [get_ports {wdata_7[47]}] [get_ports {wdata_7[46]}] [get_ports {wdata_7[45]}] [get_ports {wdata_7[44]}] [get_ports {wdata_7[43]}] [get_ports {wdata_7[42]}] [get_ports {wdata_7[41]}] [get_ports {wdata_7[40]}] [get_ports {wdata_7[39]}] [get_ports {wdata_7[38]}] [get_ports {wdata_7[37]}] [get_ports {wdata_7[36]}] [get_ports {wdata_7[35]}] [get_ports {wdata_7[34]}] [get_ports {wdata_7[33]}] [get_ports {wdata_7[32]}] [get_ports {wdata_7[31]}] [get_ports {wdata_7[30]}] [get_ports {wdata_7[29]}] [get_ports {wdata_7[28]}] [get_ports {wdata_7[27]}] [get_ports {wdata_7[26]}] [get_ports {wdata_7[25]}] [get_ports {wdata_7[24]}] [get_ports {wdata_7[23]}] [get_ports {wdata_7[22]}] [get_ports {wdata_7[21]}] [get_ports {wdata_7[20]}] [get_ports {wdata_7[19]}] [get_ports {wdata_7[18]}] [get_ports {wdata_7[17]}] [get_ports {wdata_7[16]}] [get_ports {wdata_7[15]}] [get_ports {wdata_7[14]}] [get_ports {wdata_7[13]}] [get_ports {wdata_7[12]}] [get_ports {wdata_7[11]}] [get_ports {wdata_7[10]}] [get_ports {wdata_7[9]}] [get_ports {wdata_7[8]}] [get_ports {wdata_7[7]}] [get_ports {wdata_7[6]}] [get_ports {wdata_7[5]}] [get_ports {wdata_7[4]}] [get_ports {wdata_7[3]}] [get_ports {wdata_7[2]}] [get_ports {wdata_7[1]}] [get_ports {wdata_7[0]}] [get_ports {wdata_6[63]}] [get_ports {wdata_6[62]}] [get_ports {wdata_6[61]}] [get_ports {wdata_6[60]}] [get_ports {wdata_6[59]}] [get_ports {wdata_6[58]}] [get_ports {wdata_6[57]}] [get_ports {wdata_6[56]}] [get_ports {wdata_6[55]}] [get_ports {wdata_6[54]}] [get_ports {wdata_6[53]}] [get_ports {wdata_6[52]}] [get_ports {wdata_6[51]}] [get_ports {wdata_6[50]}] [get_ports {wdata_6[49]}] [get_ports {wdata_6[48]}] [get_ports {wdata_6[47]}] [get_ports {wdata_6[46]}] [get_ports {wdata_6[45]}] [get_ports {wdata_6[44]}] [get_ports {wdata_6[43]}] [get_ports {wdata_6[42]}] [get_ports {wdata_6[41]}] [get_ports {wdata_6[40]}] [get_ports {wdata_6[39]}] [get_ports {wdata_6[38]}] [get_ports {wdata_6[37]}] [get_ports {wdata_6[36]}] [get_ports {wdata_6[35]}] [get_ports {wdata_6[34]}] [get_ports {wdata_6[33]}] [get_ports {wdata_6[32]}] [get_ports {wdata_6[31]}] [get_ports {wdata_6[30]}] [get_ports {wdata_6[29]}] [get_ports {wdata_6[28]}] [get_ports {wdata_6[27]}] [get_ports {wdata_6[26]}] [get_ports {wdata_6[25]}] [get_ports {wdata_6[24]}] [get_ports {wdata_6[23]}] [get_ports {wdata_6[22]}] [get_ports {wdata_6[21]}] [get_ports {wdata_6[20]}] [get_ports {wdata_6[19]}] [get_ports {wdata_6[18]}] [get_ports {wdata_6[17]}] [get_ports {wdata_6[16]}] [get_ports {wdata_6[15]}] [get_ports {wdata_6[14]}] [get_ports {wdata_6[13]}] [get_ports {wdata_6[12]}] [get_ports {wdata_6[11]}] [get_ports {wdata_6[10]}] [get_ports {wdata_6[9]}] [get_ports {wdata_6[8]}] [get_ports {wdata_6[7]}] [get_ports {wdata_6[6]}] [get_ports {wdata_6[5]}] [get_ports {wdata_6[4]}] [get_ports {wdata_6[3]}] [get_ports {wdata_6[2]}] [get_ports {wdata_6[1]}] [get_ports {wdata_6[0]}] [get_ports {wdata_5[63]}] [get_ports {wdata_5[62]}] [get_ports {wdata_5[61]}] [get_ports {wdata_5[60]}] [get_ports {wdata_5[59]}] [get_ports {wdata_5[58]}] [get_ports {wdata_5[57]}] [get_ports {wdata_5[56]}] [get_ports {wdata_5[55]}] [get_ports {wdata_5[54]}] [get_ports {wdata_5[53]}] [get_ports {wdata_5[52]}] [get_ports {wdata_5[51]}] [get_ports {wdata_5[50]}] [get_ports {wdata_5[49]}] [get_ports {wdata_5[48]}] [get_ports {wdata_5[47]}] [get_ports {wdata_5[46]}] [get_ports {wdata_5[45]}] [get_ports {wdata_5[44]}] [get_ports {wdata_5[43]}] [get_ports {wdata_5[42]}] [get_ports {wdata_5[41]}] [get_ports {wdata_5[40]}] [get_ports {wdata_5[39]}] [get_ports {wdata_5[38]}] [get_ports {wdata_5[37]}] [get_ports {wdata_5[36]}] [get_ports {wdata_5[35]}] [get_ports {wdata_5[34]}] [get_ports {wdata_5[33]}] [get_ports {wdata_5[32]}] [get_ports {wdata_5[31]}] [get_ports {wdata_5[30]}] [get_ports {wdata_5[29]}] [get_ports {wdata_5[28]}] [get_ports {wdata_5[27]}] [get_ports {wdata_5[26]}] [get_ports {wdata_5[25]}] [get_ports {wdata_5[24]}] [get_ports {wdata_5[23]}] [get_ports {wdata_5[22]}] [get_ports {wdata_5[21]}] [get_ports {wdata_5[20]}] [get_ports {wdata_5[19]}] [get_ports {wdata_5[18]}] [get_ports {wdata_5[17]}] [get_ports {wdata_5[16]}] [get_ports {wdata_5[15]}] [get_ports {wdata_5[14]}] [get_ports {wdata_5[13]}] [get_ports {wdata_5[12]}] [get_ports {wdata_5[11]}] [get_ports {wdata_5[10]}] [get_ports {wdata_5[9]}] [get_ports {wdata_5[8]}] [get_ports {wdata_5[7]}] [get_ports {wdata_5[6]}] [get_ports {wdata_5[5]}] [get_ports {wdata_5[4]}] [get_ports {wdata_5[3]}] [get_ports {wdata_5[2]}] [get_ports {wdata_5[1]}] [get_ports {wdata_5[0]}] [get_ports {wdata_4[63]}] [get_ports {wdata_4[62]}] [get_ports {wdata_4[61]}] [get_ports {wdata_4[60]}] [get_ports {wdata_4[59]}] [get_ports {wdata_4[58]}] [get_ports {wdata_4[57]}] [get_ports {wdata_4[56]}] [get_ports {wdata_4[55]}] [get_ports {wdata_4[54]}] [get_ports {wdata_4[53]}] [get_ports {wdata_4[52]}] [get_ports {wdata_4[51]}] [get_ports {wdata_4[50]}] [get_ports {wdata_4[49]}] [get_ports {wdata_4[48]}] [get_ports {wdata_4[47]}] [get_ports {wdata_4[46]}] [get_ports {wdata_4[45]}] [get_ports {wdata_4[44]}] [get_ports {wdata_4[43]}] [get_ports {wdata_4[42]}] [get_ports {wdata_4[41]}] [get_ports {wdata_4[40]}] [get_ports {wdata_4[39]}] [get_ports {wdata_4[38]}] [get_ports {wdata_4[37]}] [get_ports {wdata_4[36]}] [get_ports {wdata_4[35]}] [get_ports {wdata_4[34]}] [get_ports {wdata_4[33]}] [get_ports {wdata_4[32]}] [get_ports {wdata_4[31]}] [get_ports {wdata_4[30]}] [get_ports {wdata_4[29]}] [get_ports {wdata_4[28]}] [get_ports {wdata_4[27]}] [get_ports {wdata_4[26]}] [get_ports {wdata_4[25]}] [get_ports {wdata_4[24]}] [get_ports {wdata_4[23]}] [get_ports {wdata_4[22]}] [get_ports {wdata_4[21]}] [get_ports {wdata_4[20]}] [get_ports {wdata_4[19]}] [get_ports {wdata_4[18]}] [get_ports {wdata_4[17]}] [get_ports {wdata_4[16]}] [get_ports {wdata_4[15]}] [get_ports {wdata_4[14]}] [get_ports {wdata_4[13]}] [get_ports {wdata_4[12]}] [get_ports {wdata_4[11]}] [get_ports {wdata_4[10]}] [get_ports {wdata_4[9]}] [get_ports {wdata_4[8]}] [get_ports {wdata_4[7]}] [get_ports {wdata_4[6]}] [get_ports {wdata_4[5]}] [get_ports {wdata_4[4]}] [get_ports {wdata_4[3]}] [get_ports {wdata_4[2]}] [get_ports {wdata_4[1]}] [get_ports {wdata_4[0]}] [get_ports {wdata_3[63]}] [get_ports {wdata_3[62]}] [get_ports {wdata_3[61]}] [get_ports {wdata_3[60]}] [get_ports {wdata_3[59]}] [get_ports {wdata_3[58]}] [get_ports {wdata_3[57]}] [get_ports {wdata_3[56]}] [get_ports {wdata_3[55]}] [get_ports {wdata_3[54]}] [get_ports {wdata_3[53]}] [get_ports {wdata_3[52]}] [get_ports {wdata_3[51]}] [get_ports {wdata_3[50]}] [get_ports {wdata_3[49]}] [get_ports {wdata_3[48]}] [get_ports {wdata_3[47]}] [get_ports {wdata_3[46]}] [get_ports {wdata_3[45]}] [get_ports {wdata_3[44]}] [get_ports {wdata_3[43]}] [get_ports {wdata_3[42]}] [get_ports {wdata_3[41]}] [get_ports {wdata_3[40]}] [get_ports {wdata_3[39]}] [get_ports {wdata_3[38]}] [get_ports {wdata_3[37]}] [get_ports {wdata_3[36]}] [get_ports {wdata_3[35]}] [get_ports {wdata_3[34]}] [get_ports {wdata_3[33]}] [get_ports {wdata_3[32]}] [get_ports {wdata_3[31]}] [get_ports {wdata_3[30]}] [get_ports {wdata_3[29]}] [get_ports {wdata_3[28]}] [get_ports {wdata_3[27]}] [get_ports {wdata_3[26]}] [get_ports {wdata_3[25]}] [get_ports {wdata_3[24]}] [get_ports {wdata_3[23]}] [get_ports {wdata_3[22]}] [get_ports {wdata_3[21]}] [get_ports {wdata_3[20]}] [get_ports {wdata_3[19]}] [get_ports {wdata_3[18]}] [get_ports {wdata_3[17]}] [get_ports {wdata_3[16]}] [get_ports {wdata_3[15]}] [get_ports {wdata_3[14]}] [get_ports {wdata_3[13]}] [get_ports {wdata_3[12]}] [get_ports {wdata_3[11]}] [get_ports {wdata_3[10]}] [get_ports {wdata_3[9]}] [get_ports {wdata_3[8]}] [get_ports {wdata_3[7]}] [get_ports {wdata_3[6]}] [get_ports {wdata_3[5]}] [get_ports {wdata_3[4]}] [get_ports {wdata_3[3]}] [get_ports {wdata_3[2]}] [get_ports {wdata_3[1]}] [get_ports {wdata_3[0]}] [get_ports {wdata_2[63]}] [get_ports {wdata_2[62]}] [get_ports {wdata_2[61]}] [get_ports {wdata_2[60]}] [get_ports {wdata_2[59]}] [get_ports {wdata_2[58]}] [get_ports {wdata_2[57]}] [get_ports {wdata_2[56]}] [get_ports {wdata_2[55]}] [get_ports {wdata_2[54]}] [get_ports {wdata_2[53]}] [get_ports {wdata_2[52]}] [get_ports {wdata_2[51]}] [get_ports {wdata_2[50]}] [get_ports {wdata_2[49]}] [get_ports {wdata_2[48]}] [get_ports {wdata_2[47]}] [get_ports {wdata_2[46]}] [get_ports {wdata_2[45]}] [get_ports {wdata_2[44]}] [get_ports {wdata_2[43]}] [get_ports {wdata_2[42]}] [get_ports {wdata_2[41]}] [get_ports {wdata_2[40]}] [get_ports {wdata_2[39]}] [get_ports {wdata_2[38]}] [get_ports {wdata_2[37]}] [get_ports {wdata_2[36]}] [get_ports {wdata_2[35]}] [get_ports {wdata_2[34]}] [get_ports {wdata_2[33]}] [get_ports {wdata_2[32]}] [get_ports {wdata_2[31]}] [get_ports {wdata_2[30]}] [get_ports {wdata_2[29]}] [get_ports {wdata_2[28]}] [get_ports {wdata_2[27]}] [get_ports {wdata_2[26]}] [get_ports {wdata_2[25]}] [get_ports {wdata_2[24]}] [get_ports {wdata_2[23]}] [get_ports {wdata_2[22]}] [get_ports {wdata_2[21]}] [get_ports {wdata_2[20]}] [get_ports {wdata_2[19]}] [get_ports {wdata_2[18]}] [get_ports {wdata_2[17]}] [get_ports {wdata_2[16]}] [get_ports {wdata_2[15]}] [get_ports {wdata_2[14]}] [get_ports {wdata_2[13]}] [get_ports {wdata_2[12]}] [get_ports {wdata_2[11]}] [get_ports {wdata_2[10]}] [get_ports {wdata_2[9]}] [get_ports {wdata_2[8]}] [get_ports {wdata_2[7]}] [get_ports {wdata_2[6]}] [get_ports {wdata_2[5]}] [get_ports {wdata_2[4]}] [get_ports {wdata_2[3]}] [get_ports {wdata_2[2]}] [get_ports {wdata_2[1]}] [get_ports {wdata_2[0]}] [get_ports {wdata_1[63]}] [get_ports {wdata_1[62]}] [get_ports {wdata_1[61]}] [get_ports {wdata_1[60]}] [get_ports {wdata_1[59]}] [get_ports {wdata_1[58]}] [get_ports {wdata_1[57]}] [get_ports {wdata_1[56]}] [get_ports {wdata_1[55]}] [get_ports {wdata_1[54]}] [get_ports {wdata_1[53]}] [get_ports {wdata_1[52]}] [get_ports {wdata_1[51]}] [get_ports {wdata_1[50]}] [get_ports {wdata_1[49]}] [get_ports {wdata_1[48]}] [get_ports {wdata_1[47]}] [get_ports {wdata_1[46]}] [get_ports {wdata_1[45]}] [get_ports {wdata_1[44]}] [get_ports {wdata_1[43]}] [get_ports {wdata_1[42]}] [get_ports {wdata_1[41]}] [get_ports {wdata_1[40]}] [get_ports {wdata_1[39]}] [get_ports {wdata_1[38]}] [get_ports {wdata_1[37]}] [get_ports {wdata_1[36]}] [get_ports {wdata_1[35]}] [get_ports {wdata_1[34]}] [get_ports {wdata_1[33]}] [get_ports {wdata_1[32]}] [get_ports {wdata_1[31]}] [get_ports {wdata_1[30]}] [get_ports {wdata_1[29]}] [get_ports {wdata_1[28]}] [get_ports {wdata_1[27]}] [get_ports {wdata_1[26]}] [get_ports {wdata_1[25]}] [get_ports {wdata_1[24]}] [get_ports {wdata_1[23]}] [get_ports {wdata_1[22]}] [get_ports {wdata_1[21]}] [get_ports {wdata_1[20]}] [get_ports {wdata_1[19]}] [get_ports {wdata_1[18]}] [get_ports {wdata_1[17]}] [get_ports {wdata_1[16]}] [get_ports {wdata_1[15]}] [get_ports {wdata_1[14]}] [get_ports {wdata_1[13]}] [get_ports {wdata_1[12]}] [get_ports {wdata_1[11]}] [get_ports {wdata_1[10]}] [get_ports {wdata_1[9]}] [get_ports {wdata_1[8]}] [get_ports {wdata_1[7]}] [get_ports {wdata_1[6]}] [get_ports {wdata_1[5]}] [get_ports {wdata_1[4]}] [get_ports {wdata_1[3]}] [get_ports {wdata_1[2]}] [get_ports {wdata_1[1]}] [get_ports {wdata_1[0]}] [get_ports {wdata_0[63]}] [get_ports {wdata_0[62]}] [get_ports {wdata_0[61]}] [get_ports {wdata_0[60]}] [get_ports {wdata_0[59]}] [get_ports {wdata_0[58]}] [get_ports {wdata_0[57]}] [get_ports {wdata_0[56]}] [get_ports {wdata_0[55]}] [get_ports {wdata_0[54]}] [get_ports {wdata_0[53]}] [get_ports {wdata_0[52]}] [get_ports {wdata_0[51]}] [get_ports {wdata_0[50]}] [get_ports {wdata_0[49]}] [get_ports {wdata_0[48]}] [get_ports {wdata_0[47]}] [get_ports {wdata_0[46]}] [get_ports {wdata_0[45]}] [get_ports {wdata_0[44]}] [get_ports {wdata_0[43]}] [get_ports {wdata_0[42]}] [get_ports {wdata_0[41]}] [get_ports {wdata_0[40]}] [get_ports {wdata_0[39]}] [get_ports {wdata_0[38]}] [get_ports {wdata_0[37]}] [get_ports {wdata_0[36]}] [get_ports {wdata_0[35]}] [get_ports {wdata_0[34]}] [get_ports {wdata_0[33]}] [get_ports {wdata_0[32]}] [get_ports {wdata_0[31]}] [get_ports {wdata_0[30]}] [get_ports {wdata_0[29]}] [get_ports {wdata_0[28]}] [get_ports {wdata_0[27]}] [get_ports {wdata_0[26]}] [get_ports {wdata_0[25]}] [get_ports {wdata_0[24]}] [get_ports {wdata_0[23]}] [get_ports {wdata_0[22]}] [get_ports {wdata_0[21]}] [get_ports {wdata_0[20]}] [get_ports {wdata_0[19]}] [get_ports {wdata_0[18]}] [get_ports {wdata_0[17]}] [get_ports {wdata_0[16]}] [get_ports {wdata_0[15]}] [get_ports {wdata_0[14]}] [get_ports {wdata_0[13]}] [get_ports {wdata_0[12]}] [get_ports {wdata_0[11]}] [get_ports {wdata_0[10]}] [get_ports {wdata_0[9]}] [get_ports {wdata_0[8]}] [get_ports {wdata_0[7]}] [get_ports {wdata_0[6]}] [get_ports {wdata_0[5]}] [get_ports {wdata_0[4]}] [get_ports {wdata_0[3]}] [get_ports {wdata_0[2]}] [get_ports {wdata_0[1]}] [get_ports {wdata_0[0]}] [get_ports error] [get_ports force_terminate] [get_ports complete]]
set_input_delay -clock clk  0.1  [get_ports clk]
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports test_mode]
set_input_delay -clock clk  0.1  [get_ports {operation[2]}]
set_input_delay -clock clk  0.1  [get_ports {operation[1]}]
set_input_delay -clock clk  0.1  [get_ports {operation[0]}]
set_input_delay -clock clk  0.1  [get_ports error_exceed_ignore]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[15]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[14]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[13]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[12]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[11]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[10]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[9]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[8]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[7]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[6]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[5]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[4]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[3]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[2]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[1]}]
set_input_delay -clock clk  0.1  [get_ports {allowable_faulty[0]}]
set_input_delay -clock clk  0.1  [get_ports {memory_sel[2]}]
set_input_delay -clock clk  0.1  [get_ports {memory_sel[1]}]
set_input_delay -clock clk  0.1  [get_ports {memory_sel[0]}]
set_input_delay -clock clk  0.1  [get_ports {memtype[4]}]
set_input_delay -clock clk  0.1  [get_ports {memtype[3]}]
set_input_delay -clock clk  0.1  [get_ports {memtype[2]}]
set_input_delay -clock clk  0.1  [get_ports {memtype[1]}]
set_input_delay -clock clk  0.1  [get_ports {memtype[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_7[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_6[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_5[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_4[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_3[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_2[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_1[0]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[63]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[62]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[61]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[60]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[59]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[58]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[57]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[56]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[55]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[54]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[53]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[52]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[51]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[50]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[49]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[48]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[47]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[46]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[45]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[44]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[43]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[42]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[41]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[40]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[39]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[38]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[37]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[36]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[35]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[34]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[33]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[32]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[31]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[30]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[29]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[28]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[27]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[26]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[25]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[24]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[23]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[22]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[21]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[20]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[19]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[18]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[17]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[16]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[15]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[14]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[13]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[12]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[11]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[10]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[9]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[8]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[7]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[6]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[5]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[4]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[3]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[2]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[1]}]
set_input_delay -clock clk  0.1  [get_ports {rdata_0[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_7[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_6[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_5[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_4[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_3[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_2[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_1[0]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[15]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[14]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[13]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[12]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[11]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[10]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[9]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[8]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[7]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[6]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[5]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[4]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[3]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[2]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[1]}]
set_output_delay -clock clk  0.1  [get_ports {address_0[0]}]
set_output_delay -clock clk  0.1  [get_ports write_read_7]
set_output_delay -clock clk  0.1  [get_ports write_read_6]
set_output_delay -clock clk  0.1  [get_ports write_read_5]
set_output_delay -clock clk  0.1  [get_ports write_read_4]
set_output_delay -clock clk  0.1  [get_ports write_read_3]
set_output_delay -clock clk  0.1  [get_ports write_read_2]
set_output_delay -clock clk  0.1  [get_ports write_read_1]
set_output_delay -clock clk  0.1  [get_ports write_read_0]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_7[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_6[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_5[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_4[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_3[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_2[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_1[0]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[63]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[62]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[61]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[60]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[59]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[58]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[57]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[56]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[55]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[54]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[53]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[52]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[51]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[50]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[49]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[48]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[47]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[46]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[45]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[44]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[43]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[42]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[41]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[40]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[39]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[38]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[37]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[36]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[35]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[34]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[33]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[32]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[31]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[30]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[29]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[28]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[27]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[26]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[25]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[24]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[23]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[22]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[21]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[20]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[19]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[18]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[17]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[16]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[15]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[14]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[13]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[12]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[11]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[10]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[9]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[8]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[7]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[6]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[5]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[4]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[3]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[2]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[1]}]
set_output_delay -clock clk  0.1  [get_ports {wdata_0[0]}]
set_output_delay -clock clk  0.1  [get_ports error]
set_output_delay -clock clk  0.1  [get_ports force_terminate]
set_output_delay -clock clk  0.1  [get_ports complete]
